<template>
  <div class="hello">
    <h1>答题系统 </h1>
    <h2>题目类型</h2>
    <h3 :class="[show=='A'?'active':'']" @click="chooseType('A')">A题({{show=='A'?active+1:0}}/{{a.length}})</h3>
    <h3 :class="[show=='X'?'active':'']" @click="chooseType('X')">X题({{show=='X'?active+1:0}}/{{x.length}})</h3>
    <div v-if="show=='A'">
    	<div  v-for="(item,index) in a" v-if="index==active">
					<div class="title">{{index+1}}、{{item.title}}</div>
					<div class="inputa" v-for="(items,indexs) in item.choose" @click="chooseA(items,indexs)"><span  :class="[anwserA1==indexs?'active':'']" type="checkbox"  ></span>  {{indexs==0?'A':(indexs==1?'B':(indexs==2?'C':(indexs==3?'D':'E')))}}  {{items}}</div>
    			<span class="btn" @click="sureA(item)">下一题</span>
    			<div v-if="showA" class="showright">
    				答错了，正确答案是 {{item.answer}}
    			</div>
    </div>
    </div>
    <div v-if="show=='X'">
    	<div v-for="(item,index) in x" v-if="index==active">
    	<div class="title">{{index+1}}、 {{item.title}}</div>
					<div class="inputa" v-for="(items,indexs) in item.choose" @click="chooseX(items,indexs)"><span  :class="[anwserX1.indexOf(indexs)>=0?'active':'']"   ></span> {{indexs==0?'A':(indexs==1?'B':(indexs==2?'C':(indexs==3?'D':'E')))}} {{items}}</div>
    			<span class="btn" @click="surex(item)">下一题</span>
    			<div v-if="showX" class="showright">
    				答错了，正确答案是 {{item.answer}}
    			</div>
    </div>
    </div>
    
  </div>
</template>

<script>
let dataList=[
{"typeA":"A1题型","title":"肝硬化最常见的死亡原因是()","choose":"原发性肝癌;肝性脑病;感染;肝肾综合征;上消化道出血","answer":"b"},
{"typeA":"A1题型","title":"肝硬化引起内分泌紊乱下列哪项错误()","choose":"雌激素增多;雄激素增多;醛固酮增多;抗利尿激素增多;肾上腺皮质激素减少","answer":"b"},
{"typeA":"A1题型","title":"哪种疾病门静脉高压最显著()","choose":"肝炎后肝硬化;酒精性肝硬化;心源性肝硬化;布加综合征;血吸虫性肝硬化","answer":"e"},
{"typeA":"A1题型","title":"男性,36岁,腹部胀大及下肢浮肿半年,加重1个月,近1周尿量减少,每日尿量300~400ml,体检血压正常,面部无浮肿,颈静脉不充盈,心率104次/分,心音正常,无杂音,腹胀大,肝脾未触清,无压痛,双下肢高度浮肿,尿常规：蛋白微量,红细胞01/HP,白细胞02/HP,血清蛋白20g,球蛋白38g,尿纳1.8g/24h,BUN16.2μmol,最可能的是()","choose":"慢性肾炎合并尿毒症;肾小球肾病并尿毒症;缩窄性心包炎;肝硬化并肝肾综合征;慢性充血性心力衰竭","answer":"d"},
{"typeA":"A1题型","title":"男性,38岁。慢性肝病8年,近3天腹胀痛,体验：体温38℃,蜘蛛痣,全腹有压痛,给利尿剂、输血浆等治疗效果不著,此时应首先做哪项检查指导治疗()","choose":"血常规;血培养;肝功能;腹水常规及培养;肾功能","answer":"d"},
{"typeA":"A1题型","title":"女性,32岁。皮肤黄染三天,有服伯氨喹啉病史。化验：尿三胆阳性,ALT（赖氏法）1633.66mmol（98u）,总胆红102.6μmol（6.0mg%）,直接胆红素50.59μmol（2.9mg%）。这些检查结果符合下列哪个诊断()","choose":"溶血性贫血所致的黄疸;肝内胆汁淤积性黄疸;肝外阻塞性黄疸;肝细胞性黄疸;药物性黄疸","answer":"d"},
{"typeA":"A1题型","title":"男性,45岁。患肝炎后肝硬化已5年,近日来出现黄疸,血性腹水,选用何种检查最有意义()","choose":"血清抗线粒体抗体（AMA）;蛋白电泳;AFP;血氨;MAO","answer":"c"},
{"typeA":"A1题型","title":"女性,48岁。上腹痛4个月,向背部放射,尿色变深,皮肤瘙痒1个月,纳差,体重下降10余公斤,体检：皮肤巩膜明显黄染,胆囊肿大,无压痛,肝功下可触及边质软,脾未及。下列哪项检查最具有确诊价值()","choose":"B型超声波;逆行胰胆管造影;多项肝功能检查及甲胎蛋白检测;肝核素扫描;上消化道X线钡餐造影","answer":"b"},
{"typeA":"A1题型","title":"当腹内有游离腹水出现移动性浊音时,腹腔游离腹水量最少应超过()","choose":"100ml;200ml;500ml;1000ml;2000ml","answer":"d"},
{"typeA":"A1题型","title":"男性、45岁,乙型肝炎30年,近二个月来,乏力腹泻,睡眠倒置,性格与前不同易急燥,化验GPT125U,A/G：2.5/3.2,B超示：肝回声不均匀、增强,门脉内径1.6CM,少量腹水,下列哪些是最正确的()","choose":"服镇静药、卧床休息;应用抗菌素控制腹泻;不必用降血氨药物;积极应用利尿剂;禁止蛋白质饮食","answer":"e"},
{"typeA":"A1题型","title":"男性40岁,突然呕血300ml,暗红色并解黑便二次,查体：蜘蛛痣、肝肋下1.5cm质硬,脾肋下3cm,质韧,少量腹水,首选治疗方法是()","choose":"静脉注射VitK;输白蛋白;法莫替丁静注;服用氢氧化铝凝胶;静脉滴注垂体后叶素","answer":"e"},
{"typeA":"A1题型","title":"下列哪项临床表现对诊断门脉高压有特征性价值()","choose":"脾肿大;肝缩小;肝质地硬化;腹水;侧支循环的建立和开放","answer":"e"},
{"typeA":"A1题型","title":"肝肾综合征与下列何种因素最有关()","choose":"肾皮质血流减少;肾皮质坏死;肾乳头坏死;肾间质炎症改变;胆红素对炎症的毒性作用","answer":"a"},
{"typeA":"A1题型","title":"判断肝硬化肝细胞功能最有用的指标是()","choose":"血清胆固醇;血清ALP;血清转肽酶;血清白蛋白及凝血酶原时间;LDH","answer":"d"},
{"typeA":"A1题型","title":"肝硬化腹水时哪一类最常见()","choose":"低钾低氯血症;低钠血症;高钾血症;低钠合并碱中毒;低钙血症","answer":"b"},
{"typeA":"A1题型","title":"肝硬化引起脾大的主要原因()","choose":"门脉压力增高;肝静脉压力增高;肝动脉压力增高;毒性产物的刺激;腹水的压迫使脾血液回流障碍","answer":"a"},
{"typeA":"A1题型","title":"下列哪一项不是诊断肝硬化的依据()","choose":"发热、腹胀、乏力;门脉高压的临床表现;肝功能减退的临床表现;肝活检有假小叶形成;食道吞钡，X线检查示食道静脉曲张","answer":"a"},
{"typeA":"A1题型","title":"下列哪项检查对肝硬化的肝功能判断最有意义()","choose":"血清酸性磷酸酶;血清腺苷脱氨酶;白蛋白/球蛋白比例倒置;血清单胺氧化酶;血清丙氨酸氨基转换酶","answer":"c"},
{"typeA":"A1题型","title":"男性,41岁,呕鲜血300ml,而以上消化道出血急诊入院,既往有胃病史,查体腹部膨隆,移动性浊音（+）,肝未触及,脾肋下1.5cm,最可能的诊断是()","choose":"消化性溃疡;肝硬化食道静脉曲张破裂出血;急性糜烂性胃炎;胃粘膜脱垂;食管—贲门撕裂症","answer":"b"},
{"typeA":"A1题型","title":"男,40岁,患肝硬化腹水二年,近二周来发热、腹痛,尿少,全腹压痛伴轻反跳痛,腹水征阳性,腹水常规为渗出液（白细胞分类以多核为主）,周围血白细胞计数增高,应首先采取的治疗措施是()","choose":"积极治疗原发病;早期联合足量应用抗菌素;加强支持治疗输白蛋白;按腹水培养结果选用抗菌素;利尿、止痛对症处理","answer":"b"},
{"typeA":"A1题型","title":"以下哪一项更符合肝硬化失代偿期的临床表现()","choose":"蜘蛛痣、腹水、月经失调;黄疸、齿龈出血脾大;肝掌、腹水、性功能减退;黄疸、脾大、胃底静脉曲张;腹水、脾大，下肢浮肿","answer":"d"},
{"typeA":"A1题型","title":"患者因肝硬化并上消化道出血住院,经治疗出血好转,但逐渐尿少,每日在500ml,尿常规少许蛋白,血钾5.0mmol,血钠129mmol,血氯90mmol,血尿素氮24.1mmol,最可能的诊断是()","choose":"电解质紊乱;酸中毒;肝肾综合症;消化道出血;慢性肾炎","answer":"c"},
{"typeA":"A1题型","title":"对肝硬化门脉高压的诊断最有价值的是()","choose":"脾大腹水;腹壁静脉曲张;脾大、脾功能亢进;顽固性腹水;食道下段静脉曲张","answer":"e"},
{"typeA":"A1题型","title":"一肝癌病人,肿瘤直径为7cm,血胆红素总量25.5umol,直接胆红素：11.9umol,B超示有少量腹水,首选的治疗方法是()","choose":"尽早手术切除肿瘤;先改善肝功能再做手术;行肝动脉栓塞及介入治疗;化学药物治疗（静脉用药或口服）;中医中药治疗","answer":"b"},
{"typeA":"A1题型","title":"下列哪项对肝癌的诊断最有价值()","choose":"肝区疼痛;肝区血管杂音;肝质硬;肝触痛;肝边钝","answer":"b"},
{"typeA":"A1题型","title":"男性,59岁,有慢支和肝炎史,近一周精神错乱伴少尿,体检：昏迷状态,口有臭味,心肺阴性,腹膨隆,腹水征阳性,扑击样震颤未引出,首选考虑()","choose":"肺性脑病;肝性脑病;糖尿病酮症酸中毒;尿毒症;药物中毒","answer":"b"},
{"typeA":"A1题型","title":"对于代谢性碱中毒的肝性脑病患者用降氨药最好用()","choose":"苯甲酸钠;精氨酸;谷氨酸钠;谷氨酸钾;苯乙酸","answer":"b"},
{"typeA":"A1题型","title":"引起肝性脑病最多见的病因是()","choose":"血吸虫性肝硬化;中毒性肝炎;原发性肝癌;病毒性肝硬化;药物性肝炎","answer":"d"},
{"typeA":"A1题型","title":"肝性脑病患者给予肠道抗生素的目的()","choose":"防止继发性肠道感染;预防自发性腹膜炎;抑制肠道细菌生长;消除致病菌的菌素;减少真菌繁殖","answer":"c"},
{"typeA":"A1题型","title":"肝性脑病时应用乳果糖口服其主要机制是什么()","choose":"乳果糖呈酸性增加氨的排除;促进胃肠蠕动，使有毒物质排除增加;分解成乳糖和果糖使氨生成减少;使肠腔呈酸性，从而减少氨的形成和吸收;乳果糖与氨结合，促进氨的排除","answer":"d"},
{"typeA":"A1题型","title":"门脉性肝硬化患者出现消化道出血时,下列哪种情况可能诱发肝性脑病()","choose":"输生理盐水;输库存血;静脉注射，氨基已酸;静脉滴注质子泵抑制剂;口服去甲基肾上腺素","answer":"e"},
{"typeA":"A1题型","title":"肝性脑病病人前驱期（I期）最早的临床表现是()","choose":"扑翼样震颤;脑电图改变;性格的改变;精神错乱;肝臭","answer":"c"},
{"typeA":"A1题型","title":"低钾性碱中毒易诱发肝性脑病是因为()","choose":"氨产生增多;干扰了肝的功能;大脑敏感性;假性神经传导介质增多;病人对有毒物质的耐受下降","answer":"a"},
{"typeA":"A1题型","title":"一个腹水患者,6天前起反复呕,黑便,经抢救治疗后好转。近日来嗜睡,晚间烦躁不安,认人不清,轻度黄疸,两手平腕下垂时掌腕阵发震颤,其意识障碍以哪种最可能()","choose":"贫血;失血性休克;氮质血症;肝性脑病;电解质紊乱","answer":"d"},
{"typeA":"A1题型","title":"男性,38岁,高热39℃左右约2月,体重下降4公斤,厌食,吞服药片后呕鲜血500ml,随后黑便2次,不成形,呕血24小时后昏迷。查体：血压12/8kPa（90/60mmHg）。心率120次/分,ALT120IU,AKP94IU,AFP定量300ng/ml,持续8周,核素扫描示肝内弥漫性放射性稀疏区。诊断为()","choose":"炎症型肝癌，并上消化道出血和肝性脑病;肝硬变合并上消化道出血和肝性脑病;急性肝炎并上消化道出血和肝性脑病;急性肝脓肿;肝囊肿恶性变并上消化道出血和肝昏迷","answer":"a"},
{"typeA":"A1题型","title":"男性,54岁。腹部胀满二年,加重三天,便秘,尿少,伴有牙龈经常渗血,十五年前曾患无黄疸型肝炎,服三剂中药后,尿量增多,精神兴奋,吐字不清,查体：血压17.29/10.64kPa（130/80mmHg）。有扑翼样震颤,能完成简单计算,腹水征（+）,肝、脾触诊不满意。最可能的诊断是()","choose":"肝硬变腹水;肝硬变肝昏迷II期;肝硬变肝昏迷I期;脑硬变及脑缺血;肝硬变腹水、低钾血症","answer":"b"},
{"typeA":"A1题型","title":"结核性腹膜炎腹水检查的目的是()","choose":"确定腹水常规性质;腹水浓缩找TB菌;腹水TB菌培养;腹水动物接种;.腹水涂片找TB菌","answer":"a"},
{"typeA":"A1题型","title":"急性昏迷病人,口有特殊气味,体检：巩膜黄染,双侧肢体肌张力对称增高,双侧瞳孔等圆等大,对光反射迟钝,体检检查：血糖：6.5mmol,血尿素氮7.5mmol,该患者最可能的诊断是()","choose":"脑血管意外;糖尿病高渗性昏迷;尿毒;肝性脑病;镇静药过量","answer":"d"},
{"typeA":"A1题型","title":"下列哪项与肝性脑病主要诱因无关()","choose":"感染;上消化道出血;便秘;低钙血症;尿毒症","answer":"d"},
{"typeA":"A1题型","title":"关于甲胎蛋白的临床意义哪项不正确()","choose":"动态观察有助于诊断早期原发性肝癌;对判断原发性肝癌手术治疗效果有价值;慢性活动性肝炎亦可有暂时性增高;阴性结果可排除原发性肝癌诊断;对估计原发性肝癌的愈后有价值","answer":"d"},
{"typeA":"A1题型","title":"肝性脑病时下列哪项不正确()","choose":"轻度性格改变和行为异常，脑电图无明显异常;倦睡，行为异常，脑电图正常;意识错乱，行为异常，脑电图不正常;昏睡或精神错乱，脑电图不正常;神志完全丧失，不能唤醒，脑电图不正常","answer":"b"},
{"typeA":"A1题型","title":"肝性脑病诱因下列哪项可能性不大()","choose":"上消化道出血;大量排钾、利尿、放腹水;高蛋白饮食;肾上腺蛋白质激素增多;便秘、腹泻、感染","answer":"d"},
{"typeA":"A1题型","title":"急性胰腺炎一般在起病后几小时后血清淀粉酶开始升高()","choose":"0.5小时;2小时;8小时;24小时;48小时","answer":"c"},
{"typeA":"A1题型","title":"下列哪种试验,对急性胰腺炎较晚期诊断有意义()","choose":"血清淀粉酶;尿淀粉酶;血清脂肪酶;血清谷丙转氨酶;血糖","answer":"c"},
{"typeA":"A1题型","title":"目前对急性胰腺炎早期诊断有重要意义的检验指标是()","choose":"血、尿淀粉酶;血白细胞;血清脂肪酶;血糖;血钙","answer":"a"},
{"typeA":"A1题型","title":"血清淀粉酶测定正确的是()","choose":"发病后即刻升高;起病后6~12小时开始升高;淀粉酶的高低与疾病严重程度相关;超过正常2倍即可确诊;持续1周以上","answer":"b"},
{"typeA":"A1题型","title":"下列哪项是急性出血性坏死性胰腺炎实验室诊断检查特点()","choose":"血清淀粉酶显著升高;高胆红素血症;血清正铁血白蛋白升高;淀粉酶、内生肌酐清除率比值升高;血钙显著降低","answer":"e"},
{"typeA":"A1题型","title":"急性胰腺炎首发的临床表现是()","choose":"恶心、呕吐及腹胀;发热;血钙减低;腹痛;低血压或休克","answer":"d"},
{"typeA":"A1题型","title":"急性胰腺炎中对胰腺自身消化的病变起主要作用的消化酶是()","choose":"淀粉酶、脂肪酶、胰蛋白酶;胰蛋白酶、糜蛋白酶、弹力蛋白酶;肠激酶、胰蛋白酶、糜蛋白酶;磷脂酶A2、弹力蛋白酶、激肽酶;肠激酶、抗胰蛋白酶、抗糜蛋白酶","answer":"d"},
{"typeA":"A1题型","title":"下列哪项不是胰腺分泌的消化酶()","choose":"淀粉酶;糜蛋白酶;单胺氧化酶;前弹性蛋白酶;前羟肽酶","answer":"c"},
{"typeA":"A1题型","title":"急性胰腺炎患者出现下述何种症状为重症和预后不佳的征兆()","choose":"代谢性酸中毒;代谢生碱中毒;低钾血症;低镁血症;低钙血症","answer":"e"},
{"typeA":"A1题型","title":"急性胰腺炎引起休克的主要原因是()","choose":"感染;心肌损害;有效血容量不足;神经源性;用杜冷丁","answer":"c"},
{"typeA":"A1题型","title":"下列哪个疾病一般不会引起血清淀粉酶升高？()","choose":"急性胰腺炎;穿透性溃疡;胆道结石;腮腺炎;慢性胰腺炎缓解期","answer":"e"},
{"typeA":"A1题型","title":"患者女性,32岁,饱餐后上腹部剧痛5小时,伴低热、呕吐、腹平软,脐左上压痛,血清淀粉酶正常,伴有下列哪种情况后可考虑短时期内使用肾上腺糖皮质激素()","choose":"高血糖症;腹水;氮质血症;明显的低钙血症;ARDS","answer":"e"},
{"typeA":"A1题型","title":"女,38岁,饱餐后3小时感右上腹部疼痛,逐渐加重,呕吐二次为食物,4小时后来诊,既往无上腹部疼痛史,血压11/9KPA（85/70mmHg）,体温38度,心肺无异常,上腹部肌紧张,压痛明显,反跳痛阳性,血清淀粉酶250u（somogyi法）,尿淀粉酶32u（winsow法）,白细胞1.2X10^9,留观输液禁食4小时后,以上症状不缓解,下列哪项检查最有助于诊断()","choose":"纤维胃镜;血清脂肪酶测定;复查血清淀粉酶;腹部透视;心电图","answer":"c"},
{"typeA":"A1题型","title":"女性、36岁,过去有胃溃疡病史,饮酒后上腹痛6小时,进行性加剧,并蔓延至全腹,检查：有明显腹膜刺激症,以上腹部为主,肝浊音界正常,移动性浊音阳性,血清淀粉酶200单位,血钙1.62mmol,最可能的诊断是()","choose":"消化性溃疡穿孔;急性出血坏死性胰腺炎;急性化脓性胆囊炎穿孔;门静脉血栓形成;急性高位阑尾炎穿也性腹膜炎","answer":"b"},
{"typeA":"A1题型","title":"在我国急性胰腺炎的病因最常见的()","choose":"药物诱发;腮腺炎合并;高血钙症;胆囊炎、胆结石;壶腹部肿瘤","answer":"d"},
{"typeA":"A1题型","title":"为预防急性胰腺炎的发生应注意哪项()","choose":"吸烟;少食脂肪;戒酒及避免暴饮暴食;餐后剧烈运动;精神紧张","answer":"c"},
{"typeA":"A1题型","title":"女性,昨晚餐后突感上腹剧痛,恶心、呕吐,今晨腹痛向腰部放射,为尽快明确诊断,首选哪项检查()","choose":"血常规;血电解质;血尿淀粉酶;腹部B超;胃镜检查","answer":"c"},
{"typeA":"A1题型","title":"男性,30岁,酗酒后突感上腹持续钝痛2小时,向腰背部呈带状放射,体检：上腹有中度压痛,无反跳痛,双肾区无叩击痛,EKG及血常规正常,为明确诊断,应首选哪项检查()","choose":"淀粉酶测定;血清脂肪酶;肝功能检查;肾功能检查;尿常规检查","answer":"a"},
{"typeA":"A1题型","title":"患者上腹部不适二个月,自觉消瘦,查体巩膜明显黄染,皮肤有抓痕,腹软,胆囊可触及,血总胆红素333.2umol,直接胆红素为238umol,尿胆红素阳性,B超示肝内外胆管扩张,胆囊肿大,胰管稍扩张,最合适的诊断是()","choose":"肝细胞性黄疸;先天性非溶血性黄疸;胆石症;原发性硬化性胆管炎;胰头癌","answer":"e"},
{"typeA":"A1题型","title":"上消化道出血部位是指()","choose":"食管、胃出血;食管、胃、十二指肠球部出血;屈氏韧带以上部位出血;空肠以上部位出血;回盲瓣以上部位出血","answer":"c"},
{"typeA":"A1题型","title":"诊断消化性溃疡出血最可靠的方法是()","choose":"胃液分析;钡餐透视;粪便隐血试验;早期胃镜检查;询问病史","answer":"d"},
{"typeA":"A1题型","title":"下列哪种溃疡最易并发出血()","choose":"十二指肠球部溃疡;十二指肠球后溃疡;胃小弯溃疡;幽门管溃疡;复合性溃疡","answer":"b"},
{"typeA":"A1题型","title":"消化道大出血是指短时期内出血量多于()","choose":"500ml;750ml;1000ml;1250ml;1500ml","answer":"c"},
{"typeA":"A1题型","title":"患者,男,58岁,进行性贫血,消瘦乏力半年,有时右腹隐痛,无腹泻。查体：右中腹部扪及肿块,肠鸣音活跃。如果需手术治疗,术前准备最重要的是()","choose":"纠正营养;肠道准备;心肺功能检查;肝肾功能检查;心理准备","answer":"b"},
{"typeA":"A1题型","title":"男性,30岁,腹痛腹泻一年余,纤维结肠镜见结肠粘膜部分有增生呈鹅卵石表现,并可见纵行溃疡及炎性息肉,病变肠段之间粘膜正常,最可能诊断是()","choose":"结肠血吸虫病;结肠克罗恩病;溃疡性结肠炎;肠结核;结肠癌","answer":"b"},
{"typeA":"A1题型","title":"上消化道出血的临床观察方面,最早出现的变化是()","choose":"血红蛋白;红细胞比容;末梢循环改变及心率加快;网织红细胞计数;血尿素氮的测定","answer":"c"},
{"typeA":"A1题型","title":"不明原因的上消化道出血,最主要的检查方法是()","choose":"胃肠X线钡餐检查;B型超声检查;消化液检查;选择性腹腔动脉造影;纤维内窥镜检查","answer":"e"},
{"typeA":"A1题型","title":"男,46岁,主诉成形黑便2天,上腹部隐痛伴泛酸,查心率86次/分,血压正常,腹部无明显压痛,无腹块扪及,疑诊溃疡病出血。经胃镜检查十二指肠球部出血,此时应给予哪种治疗最合适？()","choose":"饮食控制;应用止血药;应用抗酸剂;减轻工作;补充营养","answer":"c"},
{"typeA":"A1题型","title":"男性,34岁,腹泻8年,每日3次无脓血,无发热,结肠镜检查：直肠乙状结肠粘膜多发浅溃疡,伴充血,水肿,诊断应为()","choose":"疑诊为溃疡性结肠炎;确诊为溃疡性结肠炎;确诊为克隆病;胃肠功能紊乱;肠结核;慢性细菌性痢疾","answer":"b"},
{"typeA":"A1题型","title":"男性,18岁,腹痛、腹泻2年,伴低热,结肠镜检查：回肠末端粘膜呈铺路石样表现,取活检病理报告为非干酪性肉芽肿,本例可诊断为()","choose":"肠结核;Crohn病;溃疡性结肠炎;肠伤寒;肠息肉","answer":"b"},
{"typeA":"A1题型","title":"结肠Crohn病的首选治疗药物()","choose":"灭滴灵;柳氮磺胺吡啶;羟氨苄青霉素;强地松;硫唑嘌呤","answer":"b"},
{"typeA":"A1题型","title":"男性,32岁,近三天解柏油样便,每日2-3次,以往常有返酸,上腹痛,晚间重,进食可缓解,查体贫血貌,肝脾不大,右上腹压痛,最可能的诊断()","choose":"肝硬化并胃底静脉曲张出血;胃癌并出血;胃炎并出血;溃疡病并出血;胆石症并出血","answer":"d"},
{"typeA":"A1题型","title":"患者因消化道出血住院三天,今晨起感头昏,心慌、查血压（80/60mmHg）,脉搏118次每分,血尿素氮12.4mmol,最可能的原因是()","choose":"肾功能不全;电解质紊乱;酸中毒;继续出血;低血糖","answer":"d"},
{"typeA":"A1题型","title":"48岁女性,上腹部不适3年,近2年来上腹不规则疼痛,食欲减退及体质减轻,T37.8度,HB85g,ESR：78mm/H,粪便急血试验++,下列哪项检查最有必要()","choose":"胃液分析;B型超声波检查;胃镜检查;血管造影检查;CT检查","answer":"c"},
{"typeA":"A1题型","title":"上消化道大出血最常见的原因是()","choose":"肝硬化食管胃底静脉曲张破裂;糜烂性出血性胃炎;消化性溃疡;胃癌;胃粘膜脱垂","answer":"c"},
{"typeA":"A1题型","title":"男性35岁,右上腹空腹痛反复发作5年,近一段加重,近三天黑便（成形）,为进一步明确诊断应首选检查()","choose":"胃肠钡餐透视;胃液分析;粪便稳血;便查钩虫卵;胃镜","answer":"e"},
{"typeA":"A1题型","title":"28岁,间歇性上腹痛三年,近来腹胀痛加重,伴呕吐,吐出物为隔餐食物,抗酸剂治疗无效,检查胃部有震水音,转动体位症状不能缓解,最可能的诊断是()","choose":"消化性溃疡合并幽门梗阻;良性十二指肠瘀滞症;粘膜脱垂症;胃癌;胃下垂","answer":"a"},
{"typeA":"A1题型","title":"男性,32岁,反复上腹痛二年余,向背部放射疼痛加重,曾二次大出血,经抢救治愈,最可能的诊断()","choose":"十二指肠球部溃疡;胃溃疡;幽门溃疡;球后溃疡;胃癌","answer":"d"},
{"typeA":"A1题型","title":"一位疑诊肝硬化消化道出血患者,经用垂体加压素静脉滴注,效果不明显,可选择下列哪项检查帮助确诊()","choose":"插胃管逐段低压吸取消化液，观察有无血迹;吞线试验;X线钡餐检查;纤维胃镜检查;选择性动脉造影","answer":"d"},
{"typeA":"A1题型","title":"中年女性患者,上腹部隐痛半年,无规律性,近三天来排黑色成型便一次/日,量中等,血压正常,血hb105g,应立即选哪组治疗措施()","choose":"禁食+输液+止血剂;输血+6氨基已酸+去甲肾上腺素;流质+输液+制酸剂+止血剂;禁食+输液+制酸剂+冰盐水洗胃;禁食+手术治疗","answer":"c"},
{"typeA":"A1题型","title":"青年男性,餐后排便,起身突然晕倒在地,无类似既往史,T：正常,P：124次/分,BP：10/8KPA（80/60mmHg）,神志清,面色苍白,肢冷出汗,心律齐,无杂音,腹平软,肝脾未触及,肠鸣音亢进,血色素90g,最佳治疗选哪组()","choose":"静推高渗葡萄糖溶液;静滴抗菌素+升压药;升压药+强心剂;补充5％碳酸氢钠;输血+抑酸剂","answer":"e"},
{"typeA":"A1题型","title":"为患者行胃肠减压时,胃管插入的深度是()","choose":"15～25cm;25～35cm;35～45cm;45~55cm;.55～65cm","answer":"d"},
{"typeA":"A1题型","title":"下列哪项不是引起腹泻的原因()","choose":"感染;胃酸过多;不洁食物;消化不良","answer":"b"},
{"typeA":"A1题型","title":"慢性腹泻的病程为()","choose":"8周;4周;2周;1周","answer":"a"},
{"typeA":"A1题型","title":"慢性腹泻患者的饮食()","choose":"禁食;普食;半流质;少渣低脂","answer":"d"},
{"typeA":"A1题型","title":"下列符合轻度口服补液的适应症为()","choose":"严重腹泻、伴恶心呕吐;休克;轻度脱水，无呕吐者;肾功能不全","answer":"c"},
{"typeA":"A1题型","title":"患者男,20岁,因腹泻引起脱水需静脉补液,5%GS250ml中最多可以加入10%KCL的量是()","choose":"7.5ml;6ml;6.5ml;8ml","answer":"a"},
{"typeA":"A1题型","title":"蒙脱石散的最佳服药时间是()","choose":"饭前;饭后;与第一口饭同服;睡前","answer":"a"},
{"typeA":"A1题型","title":"下列不属于胃肠粘膜损害因素的是()","choose":"非甾体类抗炎药;前列腺素;吸烟;过度精神紧张;.幽门螺杆菌","answer":"b"},
{"typeA":"A1题型","title":"与消化性溃疡发病有关的药物是()","choose":"前列腺素;阿司匹林;硫糖铝;多潘立酮;.胶体铋剂","answer":"b"},
{"typeA":"A1题型","title":"对溃疡性结肠炎最有价值的诊断方法是()","choose":"临床表现;便常规;X线钡剂灌肠;血清α2球蛋白测定;结肠镜检查","answer":"e"},
{"typeA":"A1题型","title":"X线钡餐检查胃溃疡的主要诊断依据是()","choose":"龛影;变形;僵硬;痉挛;缺损","answer":"a"},
{"typeA":"A1题型","title":"雷尼替丁抑制胃酸分泌的作用机制是()","choose":"与溃疡面结合形成保护屏障;抑制壁细胞分泌H+的H+-K+-ATP酶;与盐酸作用形成盐和水;通过选择性竞争结合组胺H2受体，使壁细胞分泌胃酸减少;可刺激局部内源性前列腺素的合成","answer":"d"},
{"typeA":"A1题型","title":"对诊断胃、十二指肠溃疡最有价值的检查是()","choose":"X线钡餐;大便潜血试验;纤维胃镜;胃酸测定;血常规","answer":"c"},
{"typeA":"A1题型","title":"溃疡病急性穿孔非手术治疗期间最重要的措施是()","choose":"半卧位;补液;应用抗生素;胃肠减压;全身支持治疗","answer":"c"},
{"typeA":"A1题型","title":"消化性溃疡具有特征性的临床表现为()","choose":"恶心呕吐;暖气反酸;慢性贫血;食欲减退;反复发作性上腹痛","answer":"e"},
{"typeA":"A1题型","title":"胃溃疡疼痛出现的时间多为()","choose":"餐前30分钟;餐后30分钟;餐后3~4小时;睡前;半夜","answer":"b"},
{"typeA":"A1题型","title":"十二指肠溃疡疼痛的特点是()","choose":"餐后即痛，持续2小时后缓解;餐后1小时开始，持续2小时后缓解;餐后2小时开始，持续2小时后缓解;餐后3~4小时，进餐后缓解;无规律性","answer":"d"},
{"typeA":"A1题型","title":"溃疡病患者呕血时用冰盐水洗胃的目的是()","choose":"升高血压;收缩血管;补充血容量;接触痉挛;术前准备","answer":"b"},
{"typeA":"A1题型","title":"消化性溃疡的临床表现()","choose":"恶心、呕吐;反酸、嗳气;慢性贫血;周期性发作;节律性腹痛","answer":"e"},
{"typeA":"A1题型","title":"空腹痛常见于()","choose":"胃溃疡;胃食管反流征;十二指肠溃疡;胰腺炎;胆囊炎","answer":"c"},
{"typeA":"A1题型","title":"餐后腹痛常见于()","choose":"胃溃疡;胃食管反流征;十二指肠溃疡;胰腺炎;胆囊炎","answer":"a"},
{"typeA":"A1题型","title":"十二指肠溃疡的胃酸分泌大多()","choose":".不变;增高，以餐后更明显;下降，以餐后更明显;增高，以空腹更明显;.下降，以空腹更明显","answer":"d"},
{"typeA":"A1题型","title":"在消化性溃疡的发生过程中,占主导作用的因素是()","choose":"胃酸;胃蛋白酶;促胃液素;非甾体抗炎药;幽门螺杆菌","answer":"a"},
{"typeA":"A1题型","title":"奥美拉唑治疗消化性溃疡的主要机制是()","choose":"阻止组织胺与其受体结合;抑制H+-K+ATP酶;保护胃黏膜;中和胃酸;杀灭幽门螺杆菌","answer":"b"},
{"typeA":"A1题型","title":"胃溃疡疼痛的特点是()","choose":"餐中或餐后即刻出现下餐前缓解;餐后1/2~1小时出现，下餐前缓解;餐后2~3小时出现，下餐前缓解;餐后2~3小时出现，进餐缓解;夜间痛","answer":"b"},
{"typeA":"A1题型","title":"某消化性溃疡病人,腹痛显著,医嘱给予口服碱性药物,该药服用的适宜时间是()","choose":"餐前1小时;餐前2小时;餐中;餐后1小时;餐后2小时","answer":"d"},
{"typeA":"A1题型","title":"反流物中对食管粘膜有损害作用的主要成分是()","choose":"胃酸和胃蛋白酶;胰液;胰蛋白酶;胆盐","answer":"a"},
{"typeA":"A1题型","title":"胃、十二指肠溃疡合并出血的好发部位在()","choose":"胃大弯或十二指肠后壁;胃小弯或十二指肠后壁;胃大弯或十二指肠前壁;胃小弯或十二指肠前壁;胃体","answer":"b"},
{"typeA":"A1题型","title":"消化性溃疡活动期大便隐血试验阳性,提示每日出血量为()","choose":"<1ml;1-2ml;2-3ml;3-4ml;.>5ml","answer":"e"},
{"typeA":"A1题型","title":"治疗十二指肠球部溃疡的最重要措施是()","choose":"少食多餐;保护胃黏膜;抑制胃酸;中枢镇静;早期手术","answer":"c"},
{"typeA":"A1题型","title":"治疗消化性溃疡,应用下列何种药物抑制胃酸和胃蛋白酶分泌最有效()","choose":"甲氰咪胍;阿托品;硫糖铝;前列腺素E2;氢氧化铝凝胶","answer":"a"},
{"typeA":"A1题型","title":"抑制胃酸药作用最强的药物是()","choose":"H2受体抬抗剂;抗胆碱能药物;丙谷胺;奥美拉唑;前列腺素E","answer":"d"},
{"typeA":"A1题型","title":"胃溃疡患者上腹部疼痛典型节律是()","choose":"疼痛一进食一疼痛;进食一疼痛一缓解;缓解一疼痛一进食;进食一缓解一疼痛;疼痛一进食一缓解","answer":"b"},
{"typeA":"A1题型","title":"胃溃疡发病的最主要因素是()","choose":"胃酸分泌增高;胃黏膜屏障减弱。;遗传因素;免疫因素;饮食不节","answer":"b"},
{"typeA":"A1题型","title":"消化性溃疡并发大出血急救的中心环节是()","choose":"补液输血;禁食输液;止血抗休克;手术治疗;以上均不是","answer":"c"},
{"typeA":"A1题型","title":"男性,40岁,胸痛、反酸、烧心、嗳气2个月,胃镜检查食管粘膜未见明显异常,最有助于明确诊断的检查是()","choose":"上消化道气钡双重造影;C13尿素呼气试验;24小时胃食管pH监测;腹部B超;.24小时心电监测","answer":"c"},
{"typeA":"A1题型","title":"溃疡病患者宜少量多餐,其意义是()","choose":"中和胃酸;加快胃排空;减少胆汁反流;促进胃液分泌;避免胃窦部过度扩张","answer":"e"},
{"typeA":"A1题型","title":"胃食管反流病治疗措施不包括()","choose":"应用促胃肠动力药;抗酸治疗;避免饮用咖啡和浓茶;高脂肪饮食","answer":"d"},
{"typeA":"A1题型","title":"诊断胃食管反流病的最准确的方法是()","choose":"内镜检查;食道pH监测;食道钡餐;食管滴酸试验;.质子泵抑制剂（PPI）试验治疗","answer":"a"},
{"typeA":"A1题型","title":"西咪替丁治疗消化性溃疡的机制是()","choose":"阻断H+一K+ATP;拮抗H2受体;中和胃酸;加速胃排空;延缓胃排空","answer":"b"},
{"typeA":"A1题型","title":"胃食管反流病的典型症状是()","choose":"反酸、烧心;胸骨后痛;吞咽困难;上腹痛;.上消化道出血","answer":"a"},
{"typeA":"A1题型","title":"治疗结核性腹膜炎最重要的方法是()","choose":"大量抽腹水;手术清除病灶;卧床休息，加强休息;正规全身抗痨治疗;腹腔内注入糖皮质激素","answer":"d"},
{"typeA":"A1题型","title":"结核性腹膜炎最常见的并发症是()","choose":"肠梗阻;慢性穿孔;急性穿孔;消化道出血;腹腔脓肿","answer":"a"},
{"typeA":"A1题型","title":"幽门梗阻,近期溃疡出血,反流性食管炎时,禁用下列哪种药()","choose":"法莫替丁;多潘立酮;胃复安;奥美拉唑;阿托品","answer":"e"},
{"typeA":"A1题型","title":"确诊消化性溃疡的检查是()","choose":"CT;胃镜;胃液分析;x线钡餐;胃脱落细胞检查","answer":"b"},
{"typeA":"A1题型","title":"下列不符合溃疡病临床表现的是()","choose":"胃溃疡多为食后痛;溃疡病疼痛均可位于剑突下正中;十二指肠溃疡不引起幽门梗阻;溃疡病大出血后疼痛减轻;溃疡病穿孔时可出现休克","answer":"c"},
{"typeA":"A1题型","title":"消化性溃疡病人饮食护理错误的一项是()","choose":"少量多餐;面食为主;忌酸辣、油煎食物;少量出血时可进食热流质;定时进餐，可进食低脂肪饮食","answer":"d"},
{"typeA":"A1题型","title":"对消化性溃疡出血不适用的是()","choose":"口服去甲肾上腺素;三腔二囊管压迫;冰盐水洗胃;甲氰咪胍静脉注射;纤维胃镜下高频电灼","answer":"b"},
{"typeA":"A1题型","title":"消化性溃疡病人饮食不宜脂肪过多何故()","choose":"增强蠕动;刺激黏膜发炎;胃窦扩张胃液分泌多;胃血管扩张;幽门发生梗阻","answer":"c"},
{"typeA":"A1题型","title":"消化性溃疡病人为何不宜多饮牛奶()","choose":"可止痛;含少量脂肪抑制胃酸;淡牛奶能稀释胃酸;含蛋白可中和胃酸;含钙可刺激胃酸增加","answer":"e"},
{"typeA":"A1题型","title":"消化性溃疡进食不宜过饱的原因是()","choose":"胃窦扩张刺激胃酸增多;阻塞幽门;饮食刺激溃疡出血;不易消化;刺激胃黏膜充血","answer":"a"},
{"typeA":"A1题型","title":"64岁男性患者,8年前胃肠钡剂造影检查发现胃小弯溃疡,上腹部节律性疼痛时好时坏.近来中上腹有饱胀感,大便隐血试验多次阳性,有贫血体征.您在家庭随访时首先应指导患者()","choose":"继续用药;注意饮食卫生;劳逸结合;戒除烟酒;立即就医","answer":"e"},
{"typeA":"A1题型","title":"有一患者上腹部胀痛不适已有多年,曾多次赴院就诊,拟诊为胃溃疡或慢性胃炎.当他向你咨询时,您认为最好的鉴别方法是劝他作下列哪项检查()","choose":"x线钡剂检查;大便隐血试验;纤维胃镜检查;胃液分析;胃黏膜脱落细胞检查","answer":"c"},
{"typeA":"A1题型","title":"消化性溃疡疼痛节律性消失可能是()","choose":"癌变;出血;穿孔;幽门梗阻;胃底静脉破裂","answer":"a"},
{"typeA":"A1题型","title":"胃溃疡最易发生的部位是()","choose":"贲门部;胃体部;胃小弯;胃大弯;幽门部","answer":"c"},
{"typeA":"A1题型","title":"复合性溃疡是指同时有()","choose":"胃大、小弯溃疡;胃体、窦溃疡;胃小弯与幽门管溃疡;胃与十二指肠溃疡;胃底、小弯溃疡","answer":"d"},
{"typeA":"A1题型","title":"男患30多岁,诉上腹部疼痛五年,近一周加重,腹痛以空腹为重,伴有反酸、嗳气,近两天出现黑便,查体：上腹部有轻压痛,肝脾末触及,其诊断考虑为()","choose":"慢性胃炎合并上消化道出血;胃溃疡合并上消化道出血;十二指肠球部溃疡合并上消化道出血;胃癌合并上消化道出血;肝硬化合并上消化道出血","answer":"c"},
{"typeA":"A1题型","title":"患者,男,58岁,进行性贫血,消瘦乏力半年,有时右腹隐痛,无腹泻。查体：右中腹部扪及肿块,肠鸣音活跃。下列各项检查可明确诊断的是()","choose":"纤维结肠镜;CEA;CT;B超;X线钡餐检查","answer":"a"},
{"typeA":"A1题型","title":"肠结核的主要感染途径是()","choose":"血性传播;淋巴管传播;经口感染;直接蔓延;以上都不是","answer":"c"},
{"typeA":"A1题型","title":"正常情况下胃黏膜不会被胃液所消化,是由于()","choose":"胃液中不含有可消化胃黏膜的酶;黏液-碳酸氢盐屏障的作用;胃液中的内因子对胃黏膜具有保护作用;胃液中的糖蛋白可中和胃酸;胃液中含有大量HCO3-可中和胃酸","answer":"b"},
{"typeA":"A1题型","title":"对诊断消化性溃疡穿孔最有价值的临床表现是()","choose":"突发上腹部剧痛;腹式呼吸消失;上腹部压痛明显;上腹部有反跳痛;肝浊音界消失","answer":"e"},
{"typeA":"A1题型","title":"男性,23岁,上腹痛2年,常空腹及夜间发生,进食后可缓解。半小时前餐后突感上腹部持续性剧痛。查体腹式呼吸消失,上腹肌紧张,有压痛反跳痛,肝浊音界消失,肠鸣音消失。考虑最可能的诊断是()","choose":"急性肠梗阻;急性胆囊炎;急性胰腺炎;十二指肠溃疡穿孔;胃溃疡穿孔","answer":"d"},
{"typeA":"A1题型","title":"诊断肠结核最有意义的检查是()","choose":"PPD;X线钡餐造影;.结肠镜及活检病理检查;粪便找到结核杆菌;.血结核菌抗体检查","answer":"c"},
{"typeA":"A1题型","title":"男,49岁。胃溃疡病史12年。近3个月上腹痛变为无规律,伴食欲减退。胃肠钡餐检查：胃窦部可见2.5cm～3.4cm龛影,边缘不齐。粪便隐血检查多次阳性。最有可能的诊断是()","choose":"胃溃疡并出血;胃溃疡并胃息肉;幽门管溃疡;胃溃疡恶变;胃溃疡合并幽门梗阻","answer":"d"},
{"typeA":"A1题型","title":"下列哪列对诊断消化性溃疡意义最大()","choose":"钡餐透视局部有压痛，激惹，变形;钡餐透视见龛影;胃液分析为高胃酸;多年周期性腹痛;上腹部压痛","answer":"b"},
{"typeA":"A1题型","title":"诊断胃恶性溃疡最有价值的是()","choose":"便隐血持续阳性;胃液分析;龛影直径大于2.0cm;胃镜见溃疡形状不规则，底凸凹不平;脱落细胞检查有核变异细胞","answer":"d"},
{"typeA":"A1题型","title":"胃镜检查一般在大出血后()内进行","choose":"12小时;24小时;12-24小时;24-48小时","answer":"d"},
{"typeA":"A1题型","title":"治疗结束后多长时间检测幽门螺杆菌阴性为幽门螺杆菌根除()","choose":"治疗结束的当天;1周;2周;四周;2个月","answer":"d"},
{"typeA":"A1题型","title":"下面哪种疾病一般不会导致肝癌：()","choose":"慢性乙型肝炎;慢性丙型肝炎;酒精性肝病;肝血管瘤","answer":"d"},
{"typeA":"A1题型","title":"慢性胃炎的确诊主要依赖于()","choose":"病史和体征;钡餐检查;B超检查;胃镜检查和胃粘膜活检;血清胃泌素检测","answer":"d"},
{"typeA":"A1题型","title":"下列哪种疾病或因素更容易发生酒精性肝病：()","choose":"肥胖;短期内大量饮酒;酒精过敏;服用维生素E","answer":"b"},
{"typeA":"A1题型","title":"严重酒精性肝硬化的治疗可考虑()有望延长中长期存活率","choose":"戒酒;抗肝纤维化;人工肝支持系统;肝移植","answer":"d"},
{"typeA":"A1题型","title":"关于十二指肠溃疡的治疗最佳措施是()","choose":"少食多餐+中枢镇静;保护粘膜+抑酸;抑酸+消除HP;休息+戒烟酒;清除HP+手术","answer":"c"},
{"typeA":"A1题型","title":"肝硬化患者,因3h前呕鲜红色血800mI．而急诊入院,血压18/8kPa（135/60mmHg）,脉率122次/min。以下护理中不妥的是","choose":"去枕平卧，头偏向一侧;密切观察生命体征及神志变化;流质饮食;建立静脉通路;备好三腔二囊管待用","answer":"c"},
{"typeA":"A1题型","title":"某消化性溃疡病人,出院时咨询有关食用汤类中哪种对他较适宜()","choose":"咖喱牛肉汤;菜末蛋花汤;榨菜肉丝汤;老母鸡汤;竹笋肉汤","answer":"b"},
{"typeA":"A1题型","title":"某肝硬化患者经利尿治疗后,腹水消退,但经常处在深睡状态,可被唤醒,醒后回答问题正确,去除刺激后又迅速入睡,应判断为()","choose":"谵妄;浅昏迷;昏睡;嗜睡;意识模糊","answer":"d"},
{"typeA":"A1题型","title":"患者男性,50岁,肝硬化并上消化道出血,在使用三腔二囊管压迫止血期间,突然出现躁动、紫绀、呼吸困难,此时应立即()","choose":"报告医师;吸氧;应用呼吸兴奋剂;应用镇静剂;放去气囊内气体","answer":"e"},
{"typeA":"A1题型","title":"患者,女,35岁,体检发现肝功能异常1周于2004年3月入院。体查：神清,皮肤巩膜无黄染,胸前有一蜘蛛痣,肝掌征（+）,肝、脾未扪及。实验室检查：ALT250u,AST130u,ALB35g,GLB38g,TB17μmol。1989年曾因易感冒注射丙种球蛋白。该患者最可能的临床诊断是()","choose":"药物性肝炎;慢性丙型肝炎;自身免疫性肝炎;肝吸虫病;慢性乙型肝","answer":"b"},
{"typeA":"A1题型","title":"某中年女性患者,中午服敌百虫农药半杯,晚7时被家人发现,随即送来就诊,检查：躁动不合作、流涎、出汗、心率64次/min、呼吸28次/min、瞳孔1.5mm,不宜采用()","choose":"催吐;1：5000高锰酸钾溶液洗胃;吸氧;洗胃后由胃管灌入50%硫酸镁导泻;按医嘱立即注射阿托品","answer":"a"},
{"typeA":"A1题型","title":"上消化道出血患者,血压10/6/kPa（75/45mmHg）,脉搏130次/min,面色苍白,神志恍惚,四肢厥冷,无尿,估计出血量约()","choose":"300raL以下;300～500mL;500～1000mL;1000～1500mL;1500mL以上","answer":"d"},
{"typeA":"A1题型","title":"间质水肿型胰腺炎与出血坏死性胰腺炎的主要鉴别点是有无()","choose":"休克;发热;恶心呕吐;剧烈腹痛;电解质紊乱","answer":"a"},
{"typeA":"A1题型","title":"拔除胃管的技巧包括()","choose":"Ⅰ夹闭胃管末端Ⅱ嘱患者深呼吸后屏气时拔管Ⅲ到咽喉处快速拔出Ⅰ和Ⅱ;Ⅱ和Ⅲ;Ⅰ和Ⅲ;Ⅰ、Ⅱ和Ⅲ;以上都不是","answer":"d"},
{"typeA":"A1题型","title":"做纤维胃镜术时,患者宜取()","choose":"左侧卧位头稍后仰;右侧卧位头稍后仰;头低脚高位;头高脚低位;颈后仰卧位","answer":"a"},
{"typeA":"A1题型","title":"上消化道出血伴休克时首要的护理措施为()","choose":"准备急救用品和药物;迅速配血备用;去枕平卧，头偏向一侧;遵医嘱应用止血药;开放静脉","answer":"e"},
{"typeA":"A1题型","title":"三腔气囊管压迫止血适应于()","choose":"胃底静脉曲张破裂出血;急性出血糜烂性胃炎;胃癌引起的上消化道出血;消化性溃疡并发出血;食管癌溃烂所致出血","answer":"a"},
{"typeA":"A1题型","title":"肝硬化病人为何有蜘蛛痣及肝掌()","choose":"独草素所致血管破裂;饮酒过多扩血管; 雄激素过多;缺乏维生素C;肝不能消灭雌激素","answer":"e"},
{"typeA":"A1题型","title":"女性,20岁,腹痛腹泻,乏力,午后发烧二个月,经用氟哌酸等对症治疗效果不佳,既往患肺结核,腹软,右下腹可触及包块,中等质地,下列哪项最有助于肠结核的诊断? ","choose":"闭经二个月;腹部平片可见钙化灶;右下腹可触及包块;X线钡影有'跳跃征象' ;粪便浓缩查结核菌阳性","answer":"d"},
{"typeA":"A1题型","title":"胃镜检查术后如无不适,进食时间一般为术后()","choose":"半小时;1小时;2小时;可立即进食","answer":"c"},
{"typeA":"A1题型","title":"幽门梗阻患者的呕吐物气味()","choose":"烂苹果味;酸臭或隔夜食物味;大蒜味;腥臭味","answer":"b"},
{"typeA":"A1题型","title":"最早体现大量呕血便血病人严重程度的体征是()","choose":"头晕;心率加快;血红蛋白量下降;血压下降;以上都是","answer":"b"},
{"typeA":"A1题型","title":"上消化道出血特征性的表现为()","choose":"失血性周围循环衰竭;呕血与黑便;失血性贫血;肠性氮质血症;网织红细胞持续升高","answer":"b"},
{"typeA":"A1题型","title":"上消化出血伴休克时,病人去枕平卧的意义是()","choose":"有利于止血;升高血压;防止误吸;增加回心血量;改善脑供血","answer":"e"},
{"typeA":"A1题型","title":"肝硬化病人内分泌紊乱的表现不正确的是()","choose":"男性乳房发育;肝掌、蛛蜘痣;少尿、浮肿;阳萎、性欲减退;手足抽搐","answer":"e"},
{"typeA":"A1题型","title":"溃疡病的护理中,下列哪项是错误的()","choose":"禁饮浓茶;避免进食生冷刺激性食物;劳逸结合;保持心情舒畅;经常用胃蛋白酶合剂以促进病人食欲","answer":"e"},
{"typeA":"A1题型","title":"消化系统疾病的护理哪项不妥()","choose":"腹泻时可肛门排气;腹泻时可进高蛋白、高脂饮食;呕吐后应漱口;便秘时可多吃蔬菜水果;消化道出血不宜立即灌肠","answer":"a"},
{"typeA":"A1题型","title":"肝硬化代偿期病人,严格禁用哪种食物()","choose":"含动物脂肪;高蛋白;咸菜;浓茶;酒","answer":"b"},
{"typeA":"A1题型","title":"溃疡病并发上消化道大出血,早期重要的观察指标有()","choose":"上腹部疼痛伴压痛;上腹部疼痛加重且规律性消失;头晕、心悸、面色苍白、血压下降;红细胞计数与血红蛋白降低;红细胞压积变化","answer":"c"},
{"typeA":"A1题型","title":"男性肝硬化患者的睾丸萎缩,乳房发育,蜘蛛痣等是由于()","choose":"雄激素过多;雌激素过多;肾上腺皮质激素过多;垂体功能低下;以上均不是","answer":"b"},
{"typeA":"A1题型","title":"晚期肝硬化最严重的并发症和最常见的死亡原因是()","choose":"上消化道出血;感染;肝性脑病;原发性肝癌;肝肾综合征","answer":"c"},
{"typeA":"A1题型","title":"应用三腔管过程中,患者突然出现极度呼吸困难和紫绀应()","choose":"立即清除呼吸道分泌物;准备气管切开;吸氧;抽出气囊内气体，必要时拔管;应用呼吸兴奋剂","answer":"d"},
{"typeA":"A1题型","title":"肝硬化伴大量腹水常取半卧位,目的是()","choose":"使横隔下降，减轻呼吸困难;降低腹内压;有利排尿;增加回心血量;以上都不是","answer":"a"},
{"typeA":"A1题型","title":"机体清除氨的主要方式不包括()","choose":"皮肤蒸发;合成尿素;合成谷氨酸和谷氨酰胺;经肾脏排出;经肺部呼出","answer":"a"},
{"typeA":"A1题型","title":"诊断慢性浅表性胃炎时哪项有意义？()","choose":"粘膜腺体增生;粘膜腺体减少;慢性炎细胞浸润限于粘膜浅层;固有层内多量中性粒细胞浸润;肠上皮化生","answer":"c"},
{"typeA":"A1题型","title":"慢性浅表性胃炎的主要病变特点是()","choose":"胃粘膜变薄;胃粘膜水肿;可见粘膜下血管;淋巴细胞、浆细胞浸润胃粘膜浅层;胃粘膜糜烂","answer":"d"},
{"typeA":"A1题型","title":"慢性萎缩性胃炎与慢性浅表性胃炎病变最主要的区别在于前者表现有()","choose":"肠上皮化生;淋巴滤泡形成;胃固有腺体萎缩，数量减少;粘膜表面上皮变性、坏死及再生;固有层有淋巴细胞、浆细胞浸润","answer":"c"},
{"typeA":"A1题型","title":"下列哪项对诊断慢性肥厚性胃炎是最有意义的？()","choose":"腺体萎缩;胃粘膜上皮细胞异型性增生;固有膜结缔组织增生;粘膜增厚，腺体肥大增生，腺管延长，粘液分泌细胞增多;腺体肠上皮化生","answer":"d"},
{"typeA":"A1题型","title":"下列哪种病毒属DNA病毒？()","choose":"甲型肝炎病毒;乙型肝炎病毒;丙型肝炎病毒;丁型肝炎病毒;戊型肝炎病毒","answer":"b"},
{"typeA":"A1题型","title":"肝硬化时,肝功能不全的表现有()","choose":"出血倾向;食道下段静脉曲张及破裂出血;胃肠道淤血;脾功能亢进;腹水","answer":"a"},
{"typeA":"A1题型","title":"早期肝癌指()","choose":"肿瘤直径<1cm;肿瘤直径≤3cm，数目不超过二个;肿瘤直径<5cm;尚未发现远处转移的肝癌;肿瘤直径≤3cm","answer":"b"},
{"typeA":"A1题型","title":"下列哪项与肝性脑病无密切关系()","choose":"饮酒;感染;低血钾;高胆红素血症","answer":"d"},
{"typeA":"A1题型","title":"关于急性胰腺炎的临床表现下述哪种说法不对()","choose":"90%以上有恶心，呕吐;上腹部可扪及肿块;多数出现黄疸;大部分有中等发热","answer":"c"},
{"typeA":"A1题型","title":"急性胰腺炎的病人,呕吐后腹痛情况()","choose":"减轻;加重;消失;不减轻","answer":"d"},
{"typeA":"A1题型","title":"难治性或顽固性溃疡是指()","choose":"多次发生出血者;胃泌素瘤;球后溃疡;经6～8周认真内科治疗，溃疡无好转者","answer":"d"},
{"typeA":"A1题型","title":"属于利胆药的是()","choose":"稀盐酸;胃蛋白酶;胰酶;乳酶生;熊去氧胆酸","answer":"e"},
{"typeA":"A1题型","title":"有关昂丹司琼的叙述错误的是()","choose":"为5-HT3阻断药;不良反应较重;对化疗、放疗或手术后引起的呕吐均有效;止吐作用强，明显优于甲氧氯普胺;对迟后的恶心、呕吐疗效较差","answer":"b"},
{"typeA":"A1题型","title":"能抑制胃酸形成的最后环节,发挥治疗作用的药物是()","choose":"米西替丁;哌仑西平;丙谷胺;奥美拉唑;恩前列醇","answer":"d"},
{"typeA":"A1题型","title":"急性胰腺炎是 ()    ","choose":"感染性疾病;遗传性疾病;自身消化性疾病;免疫性疾病;结缔组织病","answer":"c"},
{"typeA":"A1题型","title":"肝性脑病病人应当()","choose":"供给足量的热能与蛋白质;给予足量脂肪以提供热能;供给足量的糖和钠盐;每天给水不少于2500ml;给予足量的碳水化合物","answer":"e"},
{"typeA":"A1题型","title":"腹水的护理,错误的是()","choose":"安排舒适半卧位;臀部下肢有水肿时用海棉垫托起;长期用利尿剂应注意水电解质平衡失调;准确记录每日出人液量;每天食盐量5g以上","answer":"b"},
{"typeA":"A1题型","title":"肝硬化大量腹水患者的护理,下列哪项不妥()","choose":"半卧位;低盐饮食;尽量补液;皮肤护理;E．定期测腹围","answer":"c"},
{"typeA":"A1题型","title":"下列哪项不是损害胃粘膜的饮食因素()","choose":"浓茶;必需脂肪酸;高盐;咖啡;辛辣食物","answer":"b"},
{"typeA":"A1题型","title":"关于消化性溃疡,下列不正确的是 ()","choose":"胃溃疡患者的平均年龄比十二指肠溃疡约大10年;约10%的人口一生中患过此病;发病男多于女;溃疡病人均有上腹痛;胃溃疡多伴有慢性胃炎","answer":"d"},
{"typeA":"A1题型","title":"肝硬化代偿期的临床表现不包括()","choose":"鼻粘膜出血;食欲减退;乏力;肝脏轻度肿大;脾脏轻度肿大","answer":"a"},
{"typeA":"A1题型","title":"重症溃疡型结肠炎患者应慎用()","choose":"糖皮质激素;硫唑嘌呤;水杨酸制剂;抗胆碱能药;抗生素","answer":"d"},
{"typeA":"A1题型","title":"治疗肝硬化难治性腹水较好的办法是()","choose":"利尿药的应用;提高血浆胶体渗透压;多次单纯放腹水;保肝治疗;腹水浓缩回输","answer":"e"},
{"typeA":"A1题型","title":"关于上消化道出血哪项不正确()","choose":"指Treitz韧带以上的消化道出血;最常见的病因是消化性溃疡;呕血均呈棕褐色;多数患者可出现低热;血中尿素氮浓度可增高","answer":"c"},
{"typeA":"A1题型","title":"早期胃癌是指癌肿尚未侵及() ","choose":"粘膜层;肌层;粘膜下层;浆膜层","answer":"b"},
{"typeA":"A1题型","title":"某患者腹痛、腹胀、呕吐,未见排气现象,既往有腹部手术史,应首选检查方法是() ","choose":"钡餐检查;B超;立位腹部透视;钡灌肠","answer":"c"},
{"typeA":"A1题型","title":"单纯母乳喂养儿肠道内占绝对优势的细菌为()","choose":"大肠杆菌;嗜酸杆菌;双歧杆菌;肠球菌;空肠弯曲菌","answer":"c"},
{"typeA":"A1题型","title":"轻型和重型腹泻的区别是()","choose":"呕吐的次数;发热;腹泻每天超过10次以上;不能进食;脱水和酸中毒","answer":"e"},
{"typeA":"A1题型","title":"关于轻型腹泻的临床表现不正确的是()","choose":"以胃肠道症状为主;大便次数增多;食欲不振;无脱水;血钾<3.5mmol","answer":"e"},
{"typeA":"A1题型","title":"重型腹泻的临床表现主要指()","choose":"呕吐重;食欲差;发热;腹泻频繁;有脱水、酸中毒和电解质紊乱","answer":"e"},
{"typeA":"A1题型","title":"急性胰腺炎患者禁食的目的是() ","choose":"控制饮食;避免胃扩张;减少胃液分泌;减少胰液分泌;解除胰管痉挛","answer":"d"},
{"typeA":"A1题型","title":"关于消化性溃疡患者的饮食,哪些是不妥的()","choose":"饮食应定时定量，避免过饱过饥;避免粗糙、过冷、过热和刺激大的食物;避免急食，多加咀嚼，以增加唾液分泌;饥饿时疼痛，在餐间应加一定量零食;在发作的急性期，可少量多餐","answer":"d"},
{"typeA":"A1题型","title":"为清除肝硬化病人肠道内的积血,首选的灌肠液是() ","choose":"温开水;稀醋溶液;生理盐水;碳酸氢钠溶液;肥皂水","answer":"b"},
{"typeA":"A1题型","title":"预防原发性肝癌最重要的措施是()","choose":"防止饮水污染;不吃腌制食品;防治病毒性肝炎、肝硬化;戒烟、忌酒;防治寄生虫感染","answer":"c"},
{"typeA":"A1题型","title":"下列哪项不是引起急性胰腺炎的有关因素()","choose":"胆道疾病;酗酒;暴饮暴食;内镜逆行胆胰造影术(ERCP);甲状腺功能亢进","answer":"e"},
{"typeA":"A1题型","title":"下列哪一项不符合急性出血坏死型胰腺炎的表现()","choose":"发热持续不退;腹痛时间长;出现血压下降;出现腹膜刺激症;年老体弱者腹痛更明显","answer":"e"},
{"typeA":"A1题型","title":"结核性腹膜炎抗结核治疗原则()","choose":"早期、适量、规律、全程;早期、适量、规律、短期;早期、适量、规律、间歇;早期、半量、规律、全程;早期、半量、规律、间歇","answer":"a"},
{"typeA":"A1题型","title":"食管有3个生理性狭窄,是什么的好发部位()","choose":"梗阻;出血;癌症;炎症","answer":"c"},
{"typeA":"A1题型","title":"男性,47岁,上腹部疼痛5年,餐后半小时疼痛明显至下次餐前可缓解,近一周来节 律性疼痛消失呈顽固性疼痛,腹痛放射至背部,下列哪项诊断可能性最大? ()   ","choose":"幽门管溃疡;球后溃疡;复合性溃疡;穿透性溃疡;癌性溃疡 ","answer":"d"},
{"typeA":"A1题型","title":"46岁,男性,腹胀恶心呕吐尿少而服中药疗效不佳,慢性病容,皮肤干枯,眼睑无 浮肿,血压正常,腹部膨隆,液波震颤（+）,脾大肋下6．0cm。BuN 12mmol,血钾 3．0mmol,选择下列哪项治疗最适宜? ","choose":"限制水、钠的摄入;口服甘露醇;速尿;多潘立酮或胃复安;腹腔穿刺放液   ","answer":"c"},
{"typeA":"A1题型","title":"44岁男性上腹部疼痛5年,以餐后半小疼痛明显,服制酸药物可缓解。近一周上腹疼 痛明显而行纤维胃镜检查时,胃镜刚进入食道后病人腹痛剧烈持续而加重。最可能 诊断为()  ","choose":"急性胆囊炎;急性胰腺炎;心绞痛;急性阑尾炎;胃溃疡穿孔  ","answer":"e"},
{"typeA":"A1题型","title":"溃疡性结肠炎最严重的并发症是()   ","choose":"结肠假息肉;结肠狭窄;低蛋白血症;中毒性巨结肠;水电解质紊乱","answer":"d"},
{"typeA":"A1题型","title":"判定肝硬化肝细胞功能最有用的指标是下列哪项?()","choose":"血清胆固醇;血清ALP;血清转肽酶;血清白蛋白及凝血酶原时间;LDH ","answer":"d"},
{"typeA":"A1题型","title":"大肠癌最常见的转移途径为() ","choose":"直接蔓延;淋巴转移;动脉转移;静脉转移;种植转移 ","answer":"b"},
{"typeA":"A1题型","title":"早期胃癌诊断的最有效方法是()","choose":"B超;CT;X线钡餐造影;胃液分析;纤维胃镜","answer":"e"},
{"typeA":"A1题型","title":"胃肠减压护理措施中,下列哪项不正确 ()","choose":"病人应禁食;保持减压管通畅;胃管堵塞禁止冲洗;注意口腔护理;记录吸出液的量及性质  ","answer":"c"},
{"typeA":"A1题型","title":"昏迷病人呕吐时将头偏向一侧是为了防止 () ","choose":"呕吐加剧;昏迷加萤;血压下降;窒息;污染衣物 ","answer":"d"},
{"typeA":"A1题型","title":"慢性胃炎的主要致病因素为()","choose":"消炎药物;饮酒;吸烟;幽门螺杆菌;胆汁反流","answer":"d"},
{"typeA":"A1题型","title":"慢性胃炎的主要临床表现是()","choose":"上腹部疼痛及饱胀不适;恶心、泛酸;呕血、黑便;呕吐、腹泻;乏力、消瘦","answer":"a"},

{"typeA":"A1题型","title":"慢性胃炎基本饮食原则不包括()","choose":"高热量;高蛋白;高维生素;高纤维素;易消化 ","answer":"d"},
{"typeA":"A1题型","title":"慢性胃炎的健康教育中不正确的一项是()","choose":"注意饮食卫生;避免使用刺激胃黏膜的药物;戒除烟酒;定期应用抗生素杀灭幽门螺杆菌;防治呼吸道感染 ","answer":"d"},
{"typeA":"A1题型","title":"消化性溃疡周期性发作的时间大多在()","choose":"早春与初夏;夏季;秋季;冬季;初冬和冬春","answer":"c"},
{"typeA":"A1题型","title":"在我国引起肝硬化的最主要病因是()","choose":"病毒性肝炎;乙醇中毒;药物中毒;日本血吸虫病;慢性肠道炎症 ","answer":"a"},

{"typeA":"A1题型","title":"老年人慢性胃炎急性发作时不宜用()  ","choose":"氢氧化铝;胃酶合剂;阿托品;乙氧连氮;碳酸钙","answer":"a"},
{"typeA":"A1题型","title":"慢性胃炎伴恶性贫血治疗时宜应用的维生素是()","choose":"维生素A;维生素B;维生素B12;维生素E;维生素C","answer":"c"},
{"typeA":"A1题型","title":"肝硬化形成的组织病理标志是()","choose":"细胞变性坏死;弥漫性纡维化;再生结节形成;假小叶的形成;肝肝内血管床扭曲 ","answer":"d"},

{"typeA":"A1题型","title":"硬化肝功能失代偿期最突出的临床表现是()","choose":"肝功能异常;肝掌;蜘蛛痣;腹水;脾大 ","answer":"d"},
{"typeA":"A1题型","title":"肝硬化病人出现蜘蛛痣、肝掌、男性乳房发   育的原因是()","choose":"雌激素灭活作用减弱;垂体功能紊乱;凝血因子合成减少;醛固酮活性增加;门静脉高压引起外周血管瘀血","answer":"a"},
{"typeA":"A1题型","title":"临床上最常见的急性胃炎是()","choose":"急性浅表性胃炎;幽门螺杆菌引起的急性胃炎;急性化脓性胃炎;幽门螺杆菌以外的病原体引起的急性胃炎;急性糜烂出血性胃炎","answer":"e"},
{"typeA":"A1题型","title":"肝脏的血液供应有3/4来自()","choose":"肝动脉;门静脉;脾静脉;腹主动脉;肺静脉","answer":"b"},
{"typeA":"A1题型","title":"确诊慢性胃炎主要依靠()","choose":"胃液分析;X线钡餐检查;血清学检查;幽门螺杆菌检测;胃镜及胃黏膜活组织检查","answer":"e"},
{"typeA":"A1题型","title":"不属于消化性溃疡的黏膜防御修复因素是()","choose":"胃黏液一碳酸氢盐;上皮细胞;前列腺素;表皮生长因子;胆盐","answer":"e"},
{"typeA":"A1题型","title":"引起消化性溃疡发病最主要的黏膜侵袭因素是 ()","choose":"非甾体类抗炎药;胆盐;幽门螺杆菌感染;胃酸和胃蛋白酶;乙醇 ","answer":"d"},
{"typeA":"A1题型","title":"食管全长约()","choose":"15cm;25cm;40cm;55cm;60cm ","answer":"b"},
{"typeA":"A1题型","title":"慢性腹泻是指腹泻的病程超过 ()","choose":"1周;1个月;2个月;3个月;6个月 ","answer":"c"},
{"typeA":"A1题型","title":"目前诊断肝细胞性肝癌特异性最强的标志物是()","choose":"AKP;ALP ;AFP ;AFU ;GGT2","answer":"c"},
{"typeA":"A1题型","title":"原发性肝癌最早转移的部位是()","choose":"肠;肝;肺;脑;肾","answer":"b"},
{"typeA":"A1题型","title":"减少胰腺外分泌的方法不包括()","choose":"禁食、胃肠减压;应用胰升血糖素;应用抗胆碱药;应用质子泵抑制剂;应用抑制胰酶活性药物 ","answer":"e"},
{"typeA":"A1题型","title":"确诊急性胰腺炎的血清淀粉酶值至少超过()","choose":"100U;200U;300U;400U/;500U ","answer":"e"},
{"typeA":"A1题型","title":"具有抑制胰酶活性作用的药物是()","choose":"生长抑素;降钙素;胰升血糖素;加贝酯;西咪替丁","answer":"d"},
{"typeA":"A1题型","title":"缓解急性胰腺炎病人腹痛避免使用的药物是()","choose":"阿托品;哌替啶;吗啡;地西泮;山莨菪碱 ","answer":"c"},
{"typeA":"A1题型","title":"急性胰腺炎病人急性期需严格禁食、禁饮的时间是() ","choose":"12小时;1—3日;4—5日;6～7日;10日 ","answer":"b"},
{"typeA":"A1题型","title":"急性胰腺炎病人禁食期间每日补液量至少应达到()","choose":"l000ml;2000ml;3000ml;4000ml;5000ml","answer":"c"},
{"typeA":"A1题型","title":"急性胰腺炎病人恢复进食脂肪每日应不超过() ","choose":"20g;30g;40g;50g;60g ","answer":"d"},
{"typeA":"A1题型","title":"上消化道出血最常见的病因是()","choose":"急性胃黏膜损害;慢性胃炎;消化性溃疡;胃癌;食管一胃底静脉曲张玻裂 ","answer":"c"},
{"typeA":"A1题型","title":"呕出大量鲜红色血液且不易控制的常见病因为()  ","choose":"十二指肠溃疡出血;应激性溃疡出血;胆道出血;食管胃底静脉曲张破裂出血;胃癌出血","answer":"d"},
{"typeA":"A1题型","title":"有关上消化道出血的不正确说法是(","choose":"氮质血症但尿素氮一般< 14mmol;上消化道出血可引起发热但体温不超过38.5℃;出血早期血象大致正常;出血后消化性溃疡疼痛常加重;呕血与黑粪是上消化道出血特征性表现 ","answer":"c"},
{"typeA":"A1题型","title":"急性上消化道大出血休克的首要护理措施是()","choose":"通知医师;建立静脉通路;迅速配血;采取止血措施;密切观察病情变化 ","answer":"b"},

{"typeA":"A1题型","title":"纤维胃镜检查术前需禁食() ","choose":"4小时;8小时;12小时;16小时;20小时","answer":"b"},
{"typeA":"A1题型","title":"上消化道大出血病人取去枕平卧下肢抬高的目的是()","choose":"有利止血;防止误吸;保持呼吸道通畅;改善脑供血;防止呕吐","answer":"d"},
{"typeA":"A1题型","title":"纤维结肠镜检查术前病人开始进流质饮食的时间是()","choose":"检查前12小时;检查前24小时;检查前2~3日;检查前4~6日;检查前7日","answer":"b"},
{"typeA":"A1题型","title":"进行纤维结肠镜检查时病人应采取的体位是() ","choose":"左侧卧位、双腿伸直;左侧卧位、双腿屈曲;肘膝位;右侧卧位、双腿屈曲      ","answer":"b"},

{"typeA":"A1题型","title":"腹腔穿刺术术后应嘱病人平卧休息 ()","choose":"4~6小时;8—12小时;24小时;36小时;48小时 ","answer":"b"},
{"typeA":"A1题型","title":"刘女士,55岁。上腹胀痛不适5年余,近月来胀痛明显,食欲减退、体重下降。纤维胃镜检查结果为慢性萎缩性胃炎伴重度异型增生。治疗宜应用() ","choose":"西咪替丁;米索前列醇;奥美拉唑;手术治疗;硫糖铝","answer":"d"},
{"typeA":"A1题型","title":"李先生,38岁。消化性溃疡史5年,2小时前突然呕咖啡色胃内容物约2000ml,随后解黑便2次,血压60/30mmHg,心率120次／分。首要的治疗措施为() ","choose":"应用止血药物;立即补充血容量;继续服用抗酸药;急诊胃镜复查;严格卧床休息","answer":"b"},
{"typeA":"A1题型","title":"纤维结肠镜检查术后病人需少渣饮食的时间是术后 () ","choose":"1日内;2日内;3日内;4日内;5日内","answer":"c"},
{"typeA":"A1题型","title":"孙先生,50岁,晚宴后次晨猝死在床上,右侧腹部发现大片瘀斑,病人的死因最可能是() ","choose":"急性心肌梗死 ;脑出血;消化性溃疡急性穿孔;重症急性胰腺炎;糖尿病酮症酸中毒 ","answer":"d"},
{"typeA":"A1题型","title":"李先生,40岁。消化性溃疡伴幽门梗阻,纤维胃镜检查前须做的准备是  ()   ","choose":"洗胃;向胃内注空气 ;行胃肠减压 ;手术切除梗阻部位 ;肌内注射阿托品","answer":"a"},
{"typeA":"A1题型","title":"有关呕血与黑粪的讨论的错误观点是()","choose":"有黑粪不一定有呕血;呕血常伴黑粪;呕血呈咖啡色是血液在胃内经胃酸作用形成亚铁血红素所致;柏油样便是血红蛋白铁与肠内硫化物作用形成硫化铁所致;幽门以上出血表现为呕血，幽门以下出血表现为黑便","answer":"e"},
{"typeA":"A1题型","title":"上消化道出血早期简便有效的诊断方法是  ()","choose":"上消化道钡餐检查;纤维胃镜检查  ;胃液分析 ;胃泌素测定;粪便隐血试验 ","answer":"e"},

{"typeA":"A1题型","title":"提示上消化道出血停止的临床表现是()","choose":"肠鸣音亢进;黑粪次数增加;脉压变小;肢端转红变暖;脉搏细速;幽门以上出血只表现为呕血而幽门以下出血只表现为黑粪  ","answer":"d"},
{"typeA":"A1题型","title":"消化性溃疡最常见的并发症是()","choose":"穿孔;出血;幽门梗阻;癌变;感染","answer":"b"},
{"typeA":"A1题型","title":"胃溃疡疼痛出现的时间多为()","choose":"餐后30min;餐后3-4小时;睡前;半夜;餐前30min","answer":"a"},
{"typeA":"A1题型","title":"肝硬化失代偿期最突出的临床表现是()","choose":"贫血;呕血黑便;肝掌和蜘蛛痣;腹水;脾功能亢进","answer":"d"},
{"typeA":"A1题型","title":"肝硬化患者出现全血细胞减少的主要原因()","choose":"感染;贫血;出血倾向;脾功能亢进;内分泌功能异常","answer":"d"},
{"typeA":"A1题型","title":"急性胰腺炎患者禁食的目的是() ","choose":"控制饮食;避免胃扩张;减少胃液分泌;减少胰液分泌;防止呕吐","answer":"d"},
{"typeA":"A1题型","title":"原发性肝癌患者最突出的体征是()","choose":"黄疸;脾大;骨压痛;腹壁静脉曲张;肝脏进行性增大","answer":"e"},
{"typeA":"A1题型","title":"出现黑便提示上消化道出血量在()","choose":"＞5ml;5-20ml;20-50ml;30-50ml;50-70ml以上","answer":"e"},
{"typeA":"A1题型","title":"肝硬化内分泌失调引起的表现是()","choose":"出血;贫血;腹水;营养障碍;皮肤色素沉着","answer":"e"},
{"typeA":"A1题型","title":"水肿型胰腺炎与出血坏死型胰腺炎的主要鉴别点是()","choose":"发热;休克;剧烈腹痛、腹部体征;恶心、呕吐;电解质紊乱","answer":"c"},
{"typeA":"A1题型","title":"急性胰腺炎最基本的治疗方法是()","choose":"禁食、补液;抗生素;止痛治疗;抑肽酶;手术治疗","answer":"a"},
{"typeA":"A1题型","title":"患者女性,43岁,上腹部疼痛3年,多于每年冬、春季节好发。常在饥饿时发作,疼痛呈烧灼样,进餐后缓解。根据患者的症状,最符合的诊断是()","choose":"慢性胃炎;胃溃疡;十二指肠溃疡;胃癌;肠结核","answer":"c"},
{"typeA":"A1题型","title":"治疗肝硬化腹水时,如利尿过快,尿量过多,最易诱发()","choose":"上消化道出血;肝性脑病;感染;急性肾衰竭;酸碱失衡","answer":"b"},
{"typeA":"A1题型","title":"肝癌结节破裂出血可引起()","choose":"黄疸加深;腹部剧痛;食欲减退;高热不退;呕血不止","answer":"b"},
{"typeA":"A1题型","title":"肝性脑病患者禁用肥皂水灌肠的主要原因是()","choose":"易刺激肠蠕动;增加肠道感染的可能;预防肠道出血;肥皂水为碱性，增加氨的吸收;导致电解质紊乱","answer":"d"},
{"typeA":"A1题型","title":"肝性脑病患者的护理措施中,最重要的环节是()","choose":"加强安全措施;去除和避免一切诱发因素;注意休息;合理饮食;密切观察病情变化","answer":"b"},
{"typeA":"A1题型","title":"肠结核的预防重点是()","choose":"防止便秘，保持大便通畅;增强机体抵抗力;加强宣传教育;重视餐具消毒，讲究卫生;加强肺结核的早期诊断和治疗","answer":"e"},
{"typeA":"A1题型","title":"消化道大量出血伴休克时,最首要的紧急措施是()","choose":"吸氧;头低脚高位;迅速补充血容量;应用止血药物;紧急胃镜检查明确原因","answer":"c"},
{"typeA":"A1题型","title":"患者男性,67岁,有肝硬化病史,因呕血、黑便2天急诊入院。经补液治疗,病情稳定,患者既往多次发作肝性脑病,为预防肝性脑病的发生,应首先采取()","choose":"卧床休息;灌肠导泻，清除肠道积血;预防性使用抗生素;严格限制蛋白质摄入;输液、补液治疗","answer":"b"},
{"typeA":"A1题型","title":"患者女性,41岁,诊断为“溃疡性结肠炎”收住院,每天腹泻5-6次,有少量脓血便,对此类患者饮食护理应注意()","choose":"给予易消化、富含纤维素饮食;低蛋白饮食;进食无渣流质或半流质饮食;多进食新鲜水果;多吃蔬菜","answer":"c"},
{"typeA":"A1题型","title":"患者男性,35岁,近2年常有上腹痛隐痛,晚餐后突发上腹部刀割样疼痛,迅速遍及全腹,来院急诊,查体：痛苦面容,腹肌紧张呈板状腹,肠鸣音消失。实验室检查血清淀粉酶正常。此患者最有可能发生了","choose":"急性阑尾炎;急性胰腺炎;溃疡并发出血;溃疡病穿孔;肠梗阻","answer":"d"},
{"typeA":"A1题型","title":"患者男性,52岁,2消失前无明显诱因突然呕血约1000ml,自感头晕,心慌乏力,查体：血压80/60mmhg,腹部平软,无明显压痛,此时应首先采取的措施是","choose":"卧床休息，头偏向一侧;积极补充血容量;给予大量止血药物;手术治疗;紧急内镜检查明确出血原因","answer":"b"},
{"typeA":"A1题型","title":"患者男性,50岁,因肝硬化腹水入院,住院患者期间突然出现淡漠少言,神情恍惚,衣冠不整,吐词不清,此时应警惕患者可能出现了()","choose":"肝癌;继发感染;肝性脑病;肝肾综合征;上消化道出血","answer":"c"},
{"typeA":"A1题型","title":"患者男性,48岁,数天前饮酒后1小时出现上腹痛刀割样疼痛,向腰背部反射,疼痛难以忍受,伴呕吐,呕吐物中混有胆汁,急诊入院。在患者病情稳定后其做出院指导时最重要的是()","choose":"注意卧床休息;治疗胆道疾病;避免暴饮暴食和酗酒;保持乐观的心情;定期随访","answer":"c"},
{"typeA":"A1题型","title":"十二指肠溃疡的好发部位是()","choose":"球部;降部;水平部;升部;降部和升部","answer":"a"},
{"typeA":"A1题型","title":"以下不符合B型胃炎表现的是()","choose":"病变以胃窦部为主;血清促胃液素含量降低;壁细胞抗体滴度较低;由自身免疫引起;大多由幽门螺旋杆菌引起","answer":"d"},
{"typeA":"A1题型","title":"消化性溃疡最主要的致病菌是()","choose":"变形杆菌;大肠埃希菌;链球菌;金黄色葡萄球菌;幽门螺杆菌","answer":"e"},
{"typeA":"A1题型","title":"确诊消化性溃疡的首选检查方法()","choose":"幽门螺杆菌检查;胃液分析;血清学检查;胃镜及活组织检查;大便隐血试验","answer":"d"},
{"typeA":"A1题型","title":"上消化道出血后内镜检查的最佳时间是()","choose":"24小时以内;24-48小时;48-72小时;3-5天;5-7天","answer":"b"},
{"typeA":"A1题型","title":"引起肝硬化的病因不包括()","choose":"甲型肝炎;酒精中毒;胆汁淤积;营养障碍;血吸虫病","answer":"a"},
{"typeA":"A1题型","title":"在我国,与原发性肝癌关系最密切的是()","choose":"饮食;进食霉变食物;寄生虫感染;病毒性肝炎;饮用水污染","answer":"d"},
{"typeA":"A1题型","title":"原发性肝癌的早期,下列检查中最有诊断价值的是()","choose":"癌胚抗原;凝血酶原;甲胎蛋白;血清转氨酶;酸性同工铁蛋白","answer":"c"},
{"typeA":"A1题型","title":"上消化出血最常见的原因是()","choose":"消化道溃疡;食管胃底静脉曲张;急性胃粘膜膜损害;胃癌;慢性胃炎","answer":"a"},
{"typeA":"A1题型","title":"肝硬化腹水产生的最主要原因是()","choose":"血清白蛋白降低;门静脉压力增高;肾功能不全;脾功能亢进;便秘","answer":"b"},
{"typeA":"A1题型","title":"自身免疫性胃炎引起恶性贫血的原因是()","choose":"红细胞遭到破坏;药物不良反应;缺乏叶酸;影响铁的吸收;维生素B12吸收不良","answer":"e"},
{"typeA":"A1题型","title":"引起肝性脑病最常见的原因是()","choose":"门体分流术;原发性肝癌;妊娠急性脂肪肝;肝硬化;严重胆道感染","answer":"d"},
{"typeA":"A1题型","title":"结核分枝杆菌侵犯肠道主要是()","choose":"血液传播;经口感染;呼吸道传播;生殖道传播;体液感染","answer":"b"},
{"typeA":"A1题型","title":"患者男性,32岁,因头痛经常服用止痛剂近2年,近日上腹部不适,昨日白天突然呕血约200ml,此时应首选的检查方法是()","choose":"急诊内镜检查;吞棉线试验;X线悲惨检查;B超检查;CT检查","answer":"a"},
{"typeA":"A1题型","title":"患者男性,35岁,间歇性上腹痛4年,疼痛为空腹痛和饥饿痛,常伴有反酸、嗳气。近1周腹痛加重来院就诊,经诊断为十二指肠溃疡,该疾病反复发作最可能的原因是()","choose":"遗传因素;饮食原因;幽门螺旋杆菌感染;精神因素;吸烟","answer":"c"},
{"typeA":"A1题型","title":"男性,45岁。患肝炎后肝硬化已5年,近日来出现黄疸,血性腹水,选用何种检查最有意义()","choose":"血清抗线粒体抗体（AMA）;蛋白电泳;AFP;血氨;MAO","answer":"c"},
{"typeA":"A1题型","title":"女性,48岁。上腹痛4个月,向背部放射,尿色变深,皮肤瘙痒1个月,纳差,体重下降10余公斤,体检：皮肤巩膜明显黄染,胆囊肿大,无压痛,肝功下可触及边质软,脾未及。下列哪项检查最具有确诊价值()","choose":"B型超声波;逆行胰胆管造影;多项肝功能检查及甲胎蛋白检测;肝核素扫描;上消化道X线钡餐造影","answer":"b"},
{"typeA":"A1题型","title":"当腹内有游离腹水出现移动性浊音时,腹腔游离腹水量最少应超过()","choose":"100ml;200ml;500ml;1000ml;2000ml","answer":"d"},
{"typeA":"A1题型","title":"男性、45岁,乙型肝炎30年,近二个月来,乏力腹泻,睡眠倒置,性格与前不同易急燥,化验GPT125U,A/G：2.5/3.2,B超示：肝回声不均匀、增强,门脉内径1.6CM,少量腹水,下列哪些是最正确的()","choose":"服镇静药、卧床休息;应用抗菌素控制腹泻;不必用降血氨药物;积极应用利尿剂;禁止蛋白质饮食","answer":"e"},
{"typeA":"A1题型","title":"男性40岁,突然呕血300ml,暗红色并解黑便二次,查体：蜘蛛痣、肝肋下1.5cm质硬,脾肋下3cm,质韧,少量腹水,首选治疗方法是()","choose":"静脉注射VitK;输白蛋白;法莫替丁静注;服用氢氧化铝凝胶;静脉滴注垂体后叶素","answer":"e"},
{"typeA":"A1题型","title":"下列哪项临床表现对诊断门脉高压有特征性价值()","choose":"脾肿大;肝缩小;肝质地硬化;腹水;侧支循环的建立和开放","answer":"e"},
{"typeA":"A1题型","title":"肝肾综合征与下列何种因素最有关()","choose":"肾皮质血流减少;肾皮质坏死;肾乳头坏死;肾间质炎症改变;胆红素对炎症的毒性作用","answer":"a"},
{"typeA":"A1题型","title":"判断肝硬化肝细胞功能最有用的指标是()","choose":"血清胆固醇;血清ALP;血清转肽酶;血清白蛋白及凝血酶原时间;LDH","answer":"d"},
{"typeA":"A1题型","title":"肝硬化腹水时哪一类最常见()","choose":"低钾低氯血症;低钠血症;高钾血症;低钠合并碱中毒;低钙血症","answer":"b"},
{"typeA":"A1题型","title":"三腔气囊管压迫止血适应于()","choose":"胃底静脉曲张破裂出血;急性出血糜烂性胃炎;胃癌引起的上消化道出血;消化性溃疡并发出血;食管癌溃烂所致出血","answer":"a"},
{"typeA":"A1题型","title":"肝硬化病人为何有蜘蛛痣及肝掌()","choose":"独草素所致血管破裂;饮酒过多扩血管; 雄激素过多;缺乏维生素C;肝不能消灭雌激素","answer":"e"},
{"typeA":"A1题型","title":"女性,20岁,腹痛腹泻,乏力,午后发烧二个月,经用氟哌酸等对症治疗效果不佳,既往患肺结核,腹软,右下腹可触及包块,中等质地,下列哪项最有助于肠结核的诊断? ","choose":"闭经二个月;腹部平片可见钙化灶;右下腹可触及包块;X线钡影有'跳跃征象' ;粪便浓缩查结核菌阳性","answer":"d"},
{"typeA":"A1题型","title":"胃镜检查术后如无不适,进食时间一般为术后()","choose":"半小时;1小时;2小时;可立即进食","answer":"c"},
{"typeA":"A1题型","title":"幽门梗阻患者的呕吐物气味()","choose":"烂苹果味;酸臭或隔夜食物味;大蒜味;腥臭味","answer":"b"},
{"typeA":"A1题型","title":"最早体现大量呕血便血病人严重程度的体征是()","choose":"头晕;心率加快;血红蛋白量下降;血压下降;以上都是","answer":"b"},
{"typeA":"A1题型","title":"上消化道出血特征性的表现为()","choose":"失血性周围循环衰竭;呕血与黑便;失血性贫血;肠性氮质血症;网织红细胞持续升高","answer":"b"},
{"typeA":"A1题型","title":"上消化出血伴休克时,病人去枕平卧的意义是()","choose":"有利于止血;升高血压;防止误吸;增加回心血量;改善脑供血","answer":"e"},
{"typeA":"A1题型","title":"肝硬化病人内分泌紊乱的表现不正确的是()","choose":"男性乳房发育;肝掌、蛛蜘痣;少尿、浮肿;阳萎、性欲减退;手足抽搐","answer":"e"},
{"typeA":"A1题型","title":"溃疡病的护理中,下列哪项是错误的()","choose":"禁饮浓茶;避免进食生冷刺激性食物;劳逸结合;保持心情舒畅;经常用胃蛋白酶合剂以促进病人食欲","answer":"e"},
{"typeA":"A1题型","title":"诊断消化性溃疡出血最可靠的方法是()","choose":"胃液分析;钡餐透视;粪便隐血试验;早期胃镜检查;询问病史","answer":"d"},
{"typeA":"A1题型","title":"下列哪种溃疡最易并发出血()","choose":"十二指肠球部溃疡;十二指肠球后溃疡;胃小弯溃疡;幽门管溃疡;复合性溃疡","answer":"b"},
{"typeA":"A1题型","title":"消化道大出血是指短时期内出血量多于()","choose":"500ml;750ml;1000ml;1250ml;1500ml","answer":"c"},
{"typeA":"A1题型","title":"患者,男,58岁,进行性贫血,消瘦乏力半年,有时右腹隐痛,无腹泻。查体：右中腹部扪及肿块,肠鸣音活跃。如果需手术治疗,术前准备最重要的是()","choose":"纠正营养;肠道准备;心肺功能检查;肝肾功能检查;心理准备","answer":"b"},
{"typeA":"A1题型","title":"男性,30岁,腹痛腹泻一年余,纤维结肠镜见结肠粘膜部分有增生呈鹅卵石表现,并可见纵行溃疡及炎性息肉,病变肠段之间粘膜正常,最可能诊断是：()","choose":"结肠血吸虫病;结肠克罗恩病;溃疡性结肠炎;肠结核;结肠癌","answer":"b"},
{"typeA":"A1题型","title":"上消化道出血的临床观察方面,最早出现的变化是()","choose":"血红蛋白;红细胞比容;末梢循环改变及心率加快;网织红细胞计数;血尿素氮的测定","answer":"c"},
{"typeA":"A1题型","title":"不明原因的上消化道出血,最主要的检查方法是()","choose":"胃肠X线钡餐检查;B型超声检查;消化液检查;选择性腹腔动脉造影;纤维内窥镜检查","answer":"e"},
{"typeA":"A1题型","title":"男,46岁,主诉成形黑便2天,上腹部隐痛伴泛酸,查心率86次/分,血压正常,腹部无明显压痛,无腹块扪及,疑诊溃疡病出血。经胃镜检查十二指肠球部出血,此时应给予哪种治疗最合适？()","choose":"饮食控制;应用止血药;应用抗酸剂;减轻工作;补充营养","answer":"c"},
{"typeA":"A1题型","title":"男性,34岁,腹泻8年,每日3次无脓血,无发热,结肠镜检查：直肠乙状结肠粘膜多发浅溃疡,伴充血,水肿,诊断应为()","choose":"疑诊为溃疡性结肠炎;确诊为溃疡性结肠炎;确诊为克隆病;胃肠功能紊乱;肠结核;慢性细菌性痢疾","answer":"b"},
{"typeA":"A1题型","title":"男性,18岁,腹痛、腹泻2年,伴低热,结肠镜检查：回肠末端粘膜呈铺路石样表现,取活检病理报告为非干酪性肉芽肿,本例可诊断为()","choose":"肠结核;Crohn病;溃疡性结肠炎;肠伤寒;肠息肉","answer":"b"},
{"typeA":"A1题型","title":"结肠Crohn病的首选治疗药物()","choose":"灭滴灵;柳氮磺胺吡啶;羟氨苄青霉素;强地松;硫唑嘌呤","answer":"b"},
{"typeA":"A1题型","title":"男性,32岁,近三天解柏油样便,每日2-3次,以往常有返酸,上腹痛,晚间重,进食可缓解,查体贫血貌,肝脾不大,右上腹压痛,最可能的诊断()","choose":"肝硬化并胃底静脉曲张出血;胃癌并出血;胃炎并出血;溃疡病并出血;胆石症并出血","answer":"d"},
{"typeA":"A1题型","title":"患者因消化道出血住院三天,今晨起感头昏,心慌、查血压（80/60mmHg）,脉搏118次每分,血尿素氮12.4mmol,最可能的原因是()","choose":"肾功能不全;电解质紊乱;酸中毒;继续出血;低血糖","answer":"d"},
{"typeA":"A1题型","title":"48岁女性,上腹部不适3年,近2年来上腹不规则疼痛,食欲减退及体质减轻,T37.8度,HB85g,ESR：78mm/H,粪便急血试验++,下列哪项检查最有必要()","choose":"胃液分析;B型超声波检查;胃镜检查;血管造影检查;CT检查","answer":"c"},
{"typeA":"A1题型","title":"上消化道大出血最常见的原因是()","choose":"肝硬化食管胃底静脉曲张破裂;糜烂性出血性胃炎;消化性溃疡;胃癌;胃粘膜脱垂","answer":"c"},
{"typeA":"A1题型","title":"男性35岁,右上腹空腹痛反复发作5年,近一段加重,近三天黑便（成形）,为进一步明确诊断应首选检查()","choose":"胃肠钡餐透视;胃液分析;粪便稳血;便查钩虫卵;胃镜","answer":"e"},
{"typeA":"A1题型","title":"28岁,间歇性上腹痛三年,近来腹胀痛加重,伴呕吐,吐出物为隔餐食物,抗酸剂治疗无效,检查胃部有震水音,转动体位症状不能缓解,最可能的诊断是()","choose":"消化性溃疡合并幽门梗阻;良性十二指肠瘀滞症;粘膜脱垂症;胃癌;胃下垂","answer":"a"},
{"typeA":"A1题型","title":"男性,32岁,反复上腹痛二年余,向背部放射疼痛加重,曾二次大出血,经抢救治愈,最可能的诊断()","choose":"十二指肠球部溃疡;胃溃疡;幽门溃疡;球后溃疡;胃癌","answer":"d"},
{"typeA":"A1题型","title":"一位疑诊肝硬化消化道出血患者,经用垂体加压素静脉滴注,效果不明显,可选择下列哪项检查帮助确诊()","choose":"插胃管逐段低压吸取消化液，观察有无血迹;吞线试验;X线钡餐检查;纤维胃镜检查;选择性动脉造影","answer":"d"},
{"typeA":"A1题型","title":"中年女性患者,上腹部隐痛半年,无规律性,近三天来排黑色成型便一次/日,量中等,血压正常,血hb105g,应立即选哪组治疗措施()","choose":"禁食+输液+止血剂;输血+6氨基已酸+去甲肾上腺素;流质+输液+制酸剂+止血剂;禁食+输液+制酸剂+冰盐水洗胃;禁食+手术治疗","answer":"c"},
{"typeA":"A1题型","title":"青年男性,餐后排便,起身突然晕倒在地,无类似既往史,T：正常,P：124次/分,BP：10/8KPA（80/60mmHg）,神志清,面色苍白,肢冷出汗,心律齐,无杂音,腹平软,肝脾未触及,肠鸣音亢进,血色素90g,最佳治疗选哪组()","choose":"静推高渗葡萄糖溶液;静滴抗菌素+升压药;升压药+强心剂;补充5％碳酸氢钠;输血+抑酸剂","answer":"e"},
{"typeA":"A1题型","title":"为患者行胃肠减压时,胃管插入的深度是()","choose":"15～25cm;25～35cm;35～45cm;45~55cm;.55～65cm","answer":"d"},
{"typeA":"A1题型","title":"下列哪项不是引起腹泻的原因()","choose":"感染;胃酸过多;不洁食物;消化不良","answer":"b"},
{"typeA":"A1题型","title":"慢性腹泻的病程为()","choose":"8周;4周;2周;1周","answer":"a"},
{"typeA":"A1题型","title":"慢性腹泻患者的饮食()","choose":"禁食;普食;半流质;少渣低脂","answer":"d"},
{"typeA":"A1题型","title":"下列符合轻度口服补液的适应症为()","choose":"严重腹泻、伴恶心呕吐;休克;轻度脱水，无呕吐者;肾功能不全","answer":"c"},
{"typeA":"A1题型","title":"患者男,20岁,因腹泻引起脱水需静脉补液,5%GS250ml中最多可以加入10%KCL的量是()","choose":"7.5ml;6ml;6.5ml;8ml","answer":"a"},
{"typeA":"A1题型","title":"蒙脱石散的最佳服药时间是()","choose":"饭前;饭后;与第一口饭同服;睡前","answer":"a"},
{"typeA":"A1题型","title":"抑制胃酸药作用最强的药物是()","choose":"H2受体抬抗剂;抗胆碱能药物;丙谷胺;奥美拉唑;前列腺素E","answer":"d"},
{"typeA":"A1题型","title":"胃溃疡患者上腹部疼痛典型节律是()","choose":"疼痛一进食一疼痛;进食一疼痛一缓解;缓解一疼痛一进食;进食一缓解一疼痛;疼痛一进食一缓解","answer":"b"},
{"typeA":"A1题型","title":"胃溃疡发病的最主要因素是()","choose":"胃酸分泌增高;胃黏膜屏障减弱。;遗传因素;免疫因素;饮食不节","answer":"b"},
{"typeA":"A1题型","title":"消化性溃疡并发大出血急救的中心环节是()","choose":"补液输血;禁食输液;止血抗休克;手术治疗;以上均不是","answer":"c"},
{"typeA":"A1题型","title":"男性,40岁,胸痛、反酸、烧心、嗳气2个月,胃镜检查食管粘膜未见明显异常,最有助于明确诊断的检查是()","choose":"上消化道气钡双重造影;C13尿素呼气试验;24小时胃食管pH监测;腹部B超;.24小时心电监测","answer":"c"},
{"typeA":"A1题型","title":"急性胰腺炎的病人,呕吐后腹痛情况()","choose":"减轻;加重;消失;不减轻","answer":"d"},
{"typeA":"A1题型","title":"难治性或顽固性溃疡是指()","choose":"多次发生出血者;胃泌素瘤;球后溃疡;经6～8周认真内科治疗，溃疡无好转者","answer":"d"},
{"typeA":"A1题型","title":"属于利胆药的是()","choose":"稀盐酸;胃蛋白酶;胰酶;乳酶生;熊去氧胆酸","answer":"e"},
{"typeA":"A1题型","title":"有关昂丹司琼的叙述错误的是()","choose":"为5-HT3阻断药;不良反应较重;对化疗、放疗或手术后引起的呕吐均有效;止吐作用强，明显优于甲氧氯普胺;对迟后的恶心、呕吐疗效较差","answer":"b"},
{"typeA":"A1题型","title":"能抑制胃酸形成的最后环节,发挥治疗作用的药物是()","choose":"米西替丁;哌仑西平;丙谷胺;奥美拉唑;恩前列醇","answer":"d"},
{"typeA":"A1题型","title":"急性胰腺炎是 ()    ","choose":"感染性疾病;遗传性疾病;自身消化性疾病;免疫性疾病;结缔组织病","answer":"c"},
{"typeA":"A1题型","title":"消化性溃疡的临床表现()","choose":"恶心、呕吐;反酸、嗳气;慢性贫血;周期性发作;节律性腹痛","answer":"e"},
{"typeA":"A1题型","title":"空腹痛常见于()","choose":"胃溃疡;胃食管反流征;十二指肠溃疡;胰腺炎;胆囊炎","answer":"c"},
{"typeA":"A1题型","title":"餐后腹痛常见于()","choose":"胃溃疡;胃食管反流征;十二指肠溃疡;胰腺炎;胆囊炎","answer":"a"},
{"typeA":"A1题型","title":"十二指肠溃疡的胃酸分泌大多()","choose":".不变;增高，以餐后更明显;下降，以餐后更明显;增高，以空腹更明显;.下降，以空腹更明显","answer":"d"},
{"typeA":"A1题型","title":"在消化性溃疡的发生过程中,占主导作用的因素是()","choose":"胃酸;胃蛋白酶;促胃液素;非甾体抗炎药;幽门螺杆菌","answer":"a"},
{"typeA":"A1题型","title":"奥美拉唑治疗消化性溃疡的主要机制是()","choose":"阻止组织胺与其受体结合;抑制H+-K+ATP酶;保护胃黏膜;中和胃酸;杀灭幽门螺杆菌","answer":"b"},
{"typeA":"A1题型","title":"胃溃疡疼痛的特点是()","choose":"餐中或餐后即刻出现下餐前缓解;餐后1/2~1小时出现，下餐前缓解;餐后2~3小时出现，下餐前缓解;餐后2~3小时出现，进餐缓解;夜间痛","answer":"b"},
{"typeA":"A1题型","title":"某消化性溃疡病人,腹痛显著,医嘱给予口服碱性药物,该药服用的适宜时间是()","choose":"餐前1小时;餐前2小时;餐中;餐后1小时;餐后2小时","answer":"d"},
{"typeA":"A1题型","title":"反流物中对食管粘膜有损害作用的主要成分是()","choose":"胃酸和胃蛋白酶;胰液;胰蛋白酶;胆盐","answer":"a"},
{"typeA":"A1题型","title":"胃、十二指肠溃疡合并出血的好发部位在()","choose":"胃大弯或十二指肠后壁;胃小弯或十二指肠后壁;胃大弯或十二指肠前壁;胃小弯或十二指肠前壁;胃体","answer":"b"},
{"typeA":"A1题型","title":"消化性溃疡活动期大便隐血试验阳性,提示每日出血量为()","choose":"<1ml;1-2ml;2-3ml;3-4ml;.>5ml","answer":"e"},
{"typeA":"A1题型","title":"治疗十二指肠球部溃疡的最重要措施是()","choose":"少食多餐;保护胃黏膜;抑制胃酸;中枢镇静;早期手术","answer":"c"},
{"typeA":"A1题型","title":"治疗消化性溃疡,应用下列何种药物抑制胃酸和胃蛋白酶分泌最有效()","choose":"甲氰咪胍;阿托品;硫糖铝;前列腺素E2;氢氧化铝凝胶","answer":"a"},
{"typeA":"A1题型","title":"肝性脑病病人应当()","choose":"供给足量的热能与蛋白质;给予足量脂肪以提供热能;供给足量的糖和钠盐;每天给水不少于2500ml;给予足量的碳水化合物","answer":"e"},
{"typeA":"A1题型","title":"腹水的护理,错误的是()","choose":"安排舒适半卧位;臀部下肢有水肿时用海棉垫托起;长期用利尿剂应注意水电解质平衡失调;准确记录每日出人液量;每天食盐量5g以上","answer":"b"},
{"typeA":"A1题型","title":"肝硬化大量腹水患者的护理,下列哪项不妥()","choose":"半卧位;低盐饮食;尽量补液;皮肤护理;E．定期测腹围","answer":"c"},
{"typeA":"A1题型","title":"下列哪项不是损害胃粘膜的饮食因素()","choose":"浓茶;必需脂肪酸;高盐;咖啡;辛辣食物","answer":"b"},
{"typeA":"A1题型","title":"关于消化性溃疡,下列不正确的是 ()","choose":"胃溃疡患者的平均年龄比十二指肠溃疡约大10年;约10%的人口一生中患过此病;发病男多于女;溃疡病人均有上腹痛;胃溃疡多伴有慢性胃炎","answer":"d"},
{"typeA":"A1题型","title":"肝硬化代偿期的临床表现不包括()","choose":"鼻粘膜出血;食欲减退;乏力;肝脏轻度肿大;脾脏轻度肿大","answer":"a"},
{"typeA":"A1题型","title":"重症溃疡型结肠炎患者应慎用()","choose":"糖皮质激素;硫唑嘌呤;水杨酸制剂;抗胆碱能药;抗生素","answer":"d"},
{"typeA":"A1题型","title":"治疗肝硬化难治性腹水较好的办法是()","choose":"利尿药的应用;提高血浆胶体渗透压;多次单纯放腹水;保肝治疗;腹水浓缩回输","answer":"e"},
{"typeA":"A1题型","title":"关于上消化道出血哪项不正确()","choose":"指Treitz韧带以上的消化道出血;最常见的病因是消化性溃疡;呕血均呈棕褐色;多数患者可出现低热;血中尿素氮浓度可增高","answer":"c"},
{"typeA":"A1题型","title":"溃疡病患者宜少量多餐,其意义是()","choose":"中和胃酸;加快胃排空;减少胆汁反流;促进胃液分泌;避免胃窦部过度扩张","answer":"e"},
{"typeA":"A1题型","title":"胃食管反流病治疗措施不包括()","choose":"应用促胃肠动力药;抗酸治疗;避免饮用咖啡和浓茶;高脂肪饮食","answer":"d"},
{"typeA":"A1题型","title":"诊断胃食管反流病的最准确的方法是()","choose":"内镜检查;食道pH监测;食道钡餐;食管滴酸试验;.质子泵抑制剂（PPI）试验治疗","answer":"a"},
{"typeA":"A1题型","title":"消化道大出血是指短时期内出血量多于()","choose":"500ml;750ml;1000ml;1250ml;1500ml","answer":"c"},
{"typeA":"A1题型","title":"患者,男,58岁,进行性贫血,消瘦乏力半年,有时右腹隐痛,无腹泻。查体：右中腹部扪及肿块,肠鸣音活跃。如果需手术治疗,术前准备最重要的是()","choose":"纠正营养;肠道准备;心肺功能检查;肝肾功能检查;心理准备","answer":"b"},
{"typeA":"A1题型","title":"男性,30岁,腹痛腹泻一年余,纤维结肠镜见结肠粘膜部分有增生呈鹅卵石表现,并可见纵行溃疡及炎性息肉,病变肠段之间粘膜正常,最可能诊断是()","choose":"结肠血吸虫病;结肠克罗恩病;溃疡性结肠炎;肠结核;结肠癌","answer":"b"},
{"typeA":"A1题型","title":"上消化道出血的临床观察方面,最早出现的变化是()","choose":"血红蛋白;红细胞比容;末梢循环改变及心率加快;网织红细胞计数;血尿素氮的测定","answer":"c"},
{"typeA":"X题型","title":"根据排便习惯IBS分为哪几型()","choose":"便秘型;腹泻型;混合型;不定型","answer":"abcd"},
{"typeA":"X题型","title":"可用于治疗肠易激综合征的药物()","choose":"胃肠解痉药;止泻药;胃肠道菌群调节药;抗抑郁药","answer":"abcd"},
{"typeA":"X题型","title":"引起肠易激综合征的原因包括()","choose":"特殊饮食;精神因素;肠道菌群失调;肠道感染","answer":"abcd"},
{"typeA":"X题型","title":"关于急诊胃镜检查的描述哪项正确()","choose":"腐蚀性胃炎应尽早行胃镜检查及胃镜下治疗;急性糜烂出血性胃炎一般应在发病后24～48小时内进行;检查前应先纠正休克，改善严重贫血;有助于消化道出血的鉴别诊断","answer":"bcd"},
{"typeA":"X题型","title":"下列哪项治疗措施一般对急性糜烂出血性胃炎有效()","choose":"去除病因;质子泵抑制剂;H2受体拮抗剂;胃粘膜保护剂;内镜下止血","answer":"abcd"},
{"typeA":"X题型","title":"一般肠结核的抗结核治疗药物治疗,非首选药物的是()","choose":"异烟肼＋利福平;异烟肼＋链霉素;异烟肼＋吡嗪酰胺;异烟肼＋乙胺丁醇;异烟肼＋对氨水杨酸","answer":"bcde"},
{"typeA":"X题型","title":"易转变为大肠癌的息肉有()","choose":"腺瘤性息肉;炎症性息肉;家族性腺瘤性息肉;增生性息肉;幼年性息肉","answer":"ac"},
{"typeA":"X题型","title":"以下哪些不是直肠癌的早期症状是()","choose":"便血;排便困难，便条变细;大便习惯改变;里急后重;腹胀腹痛","answer":"abde"},
{"typeA":"X题型","title":"腌制食物中含有哪些物质与胃癌的发生无密切关系()","choose":"脂肪含量高;氯化钠含量高;亚硝酸盐;含防腐剂;.含添加剂","answer":"abde"},
{"typeA":"X题型","title":"若行手术治疗,术前不予洗胃的原因错误的是()","choose":"避免引起胃出血;避免引起胃急性扩张;避免引起胃穿孔;避免洗胃造成癌细胞的脱落种植;.避免患者出现虚脱","answer":"abce"},
{"typeA":"X题型","title":"胃食管反流病的主要发病机制包括()","choose":"夜间胃酸分泌过多;食管下括约肌压力降低;异常的食管下括约肌一过性松弛;食管廓清能力下降","answer":"bcd"},
{"typeA":"X题型","title":"下列哪些是溃疡性结肠炎的治疗原则()","choose":"控制急性发作;缓解病情;减少复发;防止并发症;早期手术切除全结肠可根治本病","answer":"abcd"},
{"typeA":"X题型","title":"下列哪些是溃疡性结肠炎的手术适应证()","choose":"中毒性巨结肠;肠穿孔;癌变;脓肿和瘘管形成","answer":"abcd"},
{"typeA":"X题型","title":"关于溃疡性结肠炎的病理改变正确的是()","choose":"病变呈广泛浅小溃疡;炎症反复发作可形成炎性息肉;病变反复发作可致结肠变形缩短;溃疡性结肠炎可出现癌变","answer":"abcd"},
{"typeA":"X题型","title":"有关溃疡性结肠炎病情和临床类型下列哪些是正确的？()","choose":"轻型腹泻每日4次以下，便血轻或无，无发热;重型腹泻每日20次以上，有大量血便，伴发热、贫血;初发型为无既往史的初次发作;慢性复发性临床最多见，发作期与缓解期交替","answer":"abcd"},
{"typeA":"X题型","title":"男性,5岁,因右下腹痛、发热2年加重7天入院,体检及结肠镜检查时发现,有肛瘘和肛裂,结肠镜检查,盲肠及回肠末端铺路石样改变,及纵行溃疡,右下腹包块试穿有脓液吸出,下列治疗方法,哪些合适()","choose":"卧床休息，支持疗法;腹痛可用阿托品;可给予甲硝唑;应用柳氮磺胺吡啶","answer":"abcd"},
{"typeA":"X题型","title":"下列哪些是炎症性肠病的肠外表现()","choose":"杵状指;虹膜睫状体炎;口腔粘膜溃疡;结节性红斑","answer":"abcd"},
{"typeA":"X题型","title":"炎症性肠病病因和发病机制至今尚未完全明确,可能的因素有()","choose":"环境因素;遗传因素;感染因素;免疫因素","answer":"abcd"},
{"typeA":"X题型","title":"下列哪些是胃癌的癌前疾病/癌前病变()","choose":"萎缩性胃炎;胃息肉;肠上皮化生;不典型增生","answer":"abcd"},
{"typeA":"X题型","title":"消化性溃疡病人的护理诊断有哪些？()","choose":"疼痛;焦虑;营养失调;知识缺乏;潜在并发症-上消化道出血、梗阻、急性穿孔","answer":"abcde"},
{"typeA":"X题型","title":"上消化道包括以下：()","choose":"口腔;咽;食管;胃;十二指肠","answer":"abcde"},
{"typeA":"X题型","title":"胃的功能包括：()","choose":"接受功能;储存功能;分泌功能;消化功能;运输及排空功能","answer":"abcde"},
{"typeA":"X题型","title":"肝的主要功能：()","choose":"合成和储存作用;分泌胆汁;解毒、防御作用;造血、代谢功能","answer":"abcd"},
{"typeA":"X题型","title":"胃镜检查常见并发症有()","choose":"心脏意外;消化道穿孔;严重感染;麻醉意外","answer":"abcd"},
{"typeA":"X题型","title":"肠镜检查的禁忌症()","choose":"肛门、直肠有严重的化脓性炎症;各种急性肠炎;妊娠期;腹膜炎、肠穿孔、腹腔内广泛粘连以及各种原因导致的肠腔狭窄者","answer":"abcd"},
{"typeA":"X题型","title":"提示成人严重大出血的征象是()","choose":"血液中红细胞数＜(2～3)×109;心率＞120次／分;患者须卧床才不头晕;收缩压90mmHg或较基础血压降低25％以上","answer":"abcd"},
{"typeA":"X题型","title":"呕血便血患者饮食护理正确的是()","choose":"肝硬化所致呕血患者限制食物中蛋白质和钠盐的摄入;食道胃底静脉曲张破裂出血患者避免服用粗糙、坚硬食物;少量出血且无呕吐时可选用温凉、清淡流质饮食;肝硬化失代偿期应给高蛋白、高维生素、高碳水化合物食物;消化性溃疡仅黑便无呕血者可给流质饮食","answer":"abcde"},
{"typeA":"X题型","title":"腹胀常见的伴随症状有()","choose":"腹痛;嗳气;腹泻;发热;便秘","answer":"abcde"},
{"typeA":"X题型","title":"减轻腹胀的方法有哪些()","choose":"运用灌肠或软便剂导泻;用薄荷油腹部热敷;肛管排气;胃肠减压;腹部按摩","answer":"abcde"},
{"typeA":"X题型","title":"腹胀患者饮食护理正确的是()","choose":"鼓励病人少食多餐，多食用蔬菜、高纤维食品;严重腹胀时应禁食;轻度腹胀患者可进食流质食物如牛奶、豆浆等;肝硬化腹水腹胀病人尽量进食各类高蛋白食物;腹胀患者限制食用易引起便秘的食品如坚果、干果等","answer":"abe"},
{"typeA":"X题型","title":"清除血氨的主要途径有()","choose":"肝内尿素合成;肝、脑、肾组织利用和消耗氨;肾是排泄氨的主要场所;低钾性碱中毒血氨过高时可以从肺部呼出少量","answer":"abcd"},
{"typeA":"X题型","title":"治疗肝性脑病正确的方法有()","choose":"生理盐水灌肠;弱酸溶液灌肠;硫酸镁导泻;乳果糖灌肠","answer":"abcd"},
{"typeA":"X题型","title":"关于肝性脑病哪些是正确的()","choose":"前驱期：轻度性格改变，可有扑翼样震颤，脑电图多数正常;昏迷前期：意识错乱，扑翼样震颤存在，脑电图异常;昏睡期：昏睡和精神错乱，扑翼样震颤可引出，脑电图异常;昏迷期（浅昏迷)：神志完全丧失，扑翼样震颤仍可引出，脑电图明显异常;昏迷期（深昏迷)：神志完全丧失，扑翼样震颤无法引出，脑电图明显异常","answer":"abce"},
{"typeA":"X题型","title":"下列哪些是结核性腹膜炎腹痛的特点()","choose":"疼痛多位于脐周和下腹;早期腹痛不明显或可始终无腹痛;并发不完全性肠梗阻时有阵发性腹痛;腹部压痛一般轻微","answer":"abcd"},
{"typeA":"X题型","title":"上消化道大出血病人病情观察应注意()","choose":"呕血、黑便次数;神志变化;血压、脉搏变化;尿量变化;皮肤、甲床色泽","answer":"abcde"},
{"typeA":"X题型","title":"肝硬化腹水反复放腹水可以引起()","choose":"蛋白质丢失;电解质紊乱;继发性腹腔感染;诱发肝性脑病","answer":"abcd"},
{"typeA":"X题型","title":"消化系统疾病有()","choose":"肺结核;胃炎;胃癌;肝癌;肠结核","answer":"bcde"},
{"typeA":"X题型","title":"消化性溃疡发生癌变的表现()","choose":"消化不良症状加重;疼痛失去原有规律性;大便隐血试验持续阳性;进行性消瘦","answer":"abcd"},
{"typeA":"X题型","title":"肝硬化内分泌失调表现有()","choose":"肝掌;蜘蛛痣;男性毛发脱落、乳房发育;女性月经不调;皮肤素沉着","answer":"abcde"},
{"typeA":"X题型","title":"治疗肝性脑病减少肠道氨的产生和吸收的措施()","choose":"限制蛋白;新霉素口服;50％硫酸镁导泻;肥皂水灌肠;乳果糖口服","answer":"abce"},
{"typeA":"X题型","title":"与原发性肝癌的发病有密切关系的因素有()","choose":"甲型肝炎;乙型肝炎;肝硬化;亚硝胺类;黄曲霉素类","answer":"bcde"},
{"typeA":"X题型","title":"肝硬化腹水形成和哪些因素有关()","choose":"门静脉压力增高;肝淋巴液生成增多;低蛋白血症;抗利尿激素及继发性醛固酮增加;肾小球滤过率降低，水钠潴留","answer":"abcde"},
{"typeA":"X题型","title":"消化性溃疡伴幽门梗阻的正确治疗措施有()","choose":"禁食和胃肠减压;补充水和电解质;积极治疗溃疡病;抗胆碱剂的应用;紧急外科手术","answer":"abc"},
{"typeA":"X题型","title":"消化性溃疡常见的并发症()","choose":"穿孔;上消化道大出血;幽门梗阻;癌变;胃炎","answer":"abcd"},
{"typeA":"X题型","title":"下列属消化系统疾病的常见症状的是() ","choose":"便秘;恶心、呕吐;腹胀;呕血与黑便;腹水","answer":"abcde"},
{"typeA":"X题型","title":"急性胰腺炎常见诱因是() ","choose":"胆道疾病;大量饮酒;饱餐;高热;情绪波动","answer":"abce"},
{"typeA":"X题型","title":"肝性脑病发病相关的因素有() ","choose":"假神经递质;支链氨基酸增多;血氨增高;芳香氨基酸减少;五羟色胺产生增多","answer":"ace"},
{"typeA":"X题型","title":"门静脉高压症的临床表现为() ","choose":"腹水;脾大、脾功能亢进;肝掌;腹壁脐周静脉曲张;蜘蛛痣","answer":"abd"},
{"typeA":"X题型","title":"下面有溃疡性结肠炎的描述正确的是() ","choose":"病变限于大肠粘膜与粘膜下层;腹泻;黏液脓血便;腹痛;多见于20-40岁 ","answer":"abcde"},
{"typeA":"X题型","title":"下列有关急性胰腺炎引发的腹痛叙述正确的是()","choose":"可向腰背部放射;为间断性的疼痛;进食后缓解;弯腰时加重;为持续性的疼痛 ","answer":"ae"},
{"typeA":"X题型","title":"急性胰腺炎可引起下列哪些并发症()","choose":"腹膜炎;急性肾衰;呼吸窘迫综合征;败血症;DIC","answer":"abcde"},
{"typeA":"X题型","title":"上消化道出血未止的指标是()","choose":"反复呕血;呕血转为鲜红;经快速补液输血中心静脉压仍有波动;血尿素氮降低;网织红细胞计数下降","answer":"abc"},
{"typeA":"X题型","title":"及时评估上消化道出血量的可靠指标是（  ） ","choose":"血红蛋白含量有无下降;病人自我感;呕血与黑便的性状;心率有无增减;血压有无下降","answer":"cde"},
{"typeA":"X题型","title":"胃溃疡疼痛特点可有（  ） ","choose":"餐后1小时;中上腹偏左;中上腹偏右;两餐之间;午夜 ","answer":"abd"},
{"typeA":"X题型","title":"十二指肠为小肠的起始段,包绕胰头,可分为()","choose":"球部;降部;水平部;升部","answer":"abcd"},
{"typeA":"X题型","title":"下消化道包括()","choose":"盲肠;阑尾;结肠;直肠","answer":"abcd"},
{"typeA":"X题型","title":"腹部触诊顺序为()","choose":"从左到右;从下至上;从健侧到患侧;从右到左","answer":"abc"},
{"typeA":"X题型","title":"肠镜下息肉摘除术后要密切观察患者()","choose":"腹痛;腹胀;排便情况","answer":"abc"},
{"typeA":"X题型","title":"肠镜检查的禁忌症()","choose":"肛门、直肠有严重的化脓性炎症;各种急性肠炎;妊娠期;腹膜炎、肠穿孔、腹腔内广泛粘连以及各种原因导致的肠腔狭窄者","answer":"abcd"},
{"typeA":"X题型","title":"呕血便血患者饮食护理正确的是()","choose":"肝硬化所致呕血患者限制食物中蛋白质和钠盐的摄入;食道胃底静脉曲张破裂出血患者避免服用粗糙、坚硬食物;少量出血且无呕吐时可选用温凉、清淡流质饮食;肝硬化失代偿期应给高蛋白、高维生素、高碳水化合物食物;消化性溃疡仅黑便无呕血者可给流质饮食","answer":"abcde"},
{"typeA":"X题型","title":"食管三个狭窄距门齿的距离分别是()","choose":"15厘米;25厘米;40厘米;50厘米","answer":"abc"},
{"typeA":"X题型","title":"及时评估上消化道出血量的可靠指标是（  ） ","choose":"血红蛋白含量有无下降;病人自我感;呕血与黑便的性状;心率有无增减;血压有无下降","answer":"cde"},
{"typeA":"X题型","title":"肝硬化顽固性腹水患者,反复抽腹水可导致()","choose":"电解质紊乱;腹膜炎;肝性脑病;低钾性碱中毒","answer":"abcd"},
{"typeA":"X题型","title":"肝硬化食管静脉曲张破裂大出血后发生的变化有()","choose":"血浆尿素氮升高;脾缩小;诱发肝性脑病;出现肝肾综合征","answer":"abcd"},
{"typeA":"X题型","title":"垂体后叶素的副作用有()","choose":"腹痛;尿少;诱发心绞痛;低钠血症","answer":"abcd"},
{"typeA":"X题型","title":"属于消化腺的是()","choose":"肝;脾;胰;舌;肾上腺","answer":"ac"},
{"typeA":"X题型","title":"急性重型肝炎的特点是()","choose":"起病急、病变发展迅猛，病死率高;大片肝细胞坏死;无明显肝细胞再生现象;肝脏体积显著缩小，尤以左叶为甚;急性黄色肝萎缩","answer":"abcde"},
{"typeA":"X题型","title":"关于硫酸镁的药理作用,下列叙述哪些正确？()","choose":"降低血压;导泻作用;松弛骨骼肌;利胆作用","answer":"abcd"},
{"typeA":"X题型","title":"理想的抗酸药应具备哪些特点？()","choose":"作用迅速持久;不产气;不引起腹泻或便秘;对粘膜及溃疡面有保护收敛作用","answer":"abcd"},
{"typeA":"X题型","title":"肝肾综合征的主要临床表现是()","choose":"自发性少尿或无尿;氮质血症;稀释性低钠血症;低尿钠","answer":"abcd"},
{"typeA":"X题型","title":"炎症性肠病病因和发病机制至今尚未完全明确,可能的因素有()","choose":"环境因素;遗传因素;感染因素;免疫因素","answer":"abcd"},
{"typeA":"X题型","title":"小肠是由哪些组成()","choose":"十二指肠;空肠;回肠;盲肠;升结肠","answer":"abc"},
{"typeA":"X题型","title":"肝性脑病患者的饮食中应有丰富的维生素,包括(    )","choose":"维生素A;维生素B;维生素C;维生素E;维生素K","answer":"bcde"},
{"typeA":"X题型","title":"黄疽所致的皮肤瘙痒患者,正确的护理措施是(    )","choose":"按医嘱服用朴尔敏;面部擦炉甘石洗剂;用肥皂水全身沐浴;冰水浸浴止痒;睡前行温水浴","answer":"abe"},
{"typeA":"X题型","title":"肝硬化失代偿期强调卧床休息的目的是(    ) ","choose":"减少肝脏代谢负担;增加肝脏血流量;有利肝细胞恢复;降低门静脉压力","answer":"abcd"},
{"typeA":"X题型","title":"纤维胃镜术的麻醉方法是(    ) ","choose":"1％普鲁卡因局麻;含服利多卡因胶浆剂;4％利多卡因喷雾麻醉;硬膜外麻醉;腰麻","answer":"bc"},
{"typeA":"X题型","title":"上消化道大出血病人病情观察应注意()","choose":"呕血、黑便次数;神志变化;血压、脉搏变化;尿量变化;皮肤、甲床色泽","answer":"abcde"},
{"typeA":"X题型","title":"肠镜检查的禁忌症()","choose":"肛门、直肠有严重的化脓性炎症;各种急性肠炎;妊娠期;腹膜炎、肠穿孔、腹腔内广泛粘连以及各种原因导致的肠腔狭窄者","answer":"abcd"},
{"typeA":"X题型","title":"急性胰腺炎可引起下列哪些并发症()","choose":"腹膜炎;急性肾衰;呼吸窘迫综合征;败血症;DIC","answer":"abcde"},
{"typeA":"X题型","title":"下列哪些是溃疡性结肠炎的治疗原则()","choose":"控制急性发作;缓解病情;减少复发;防止并发症;早期手术切除全结肠可根治本病","answer":"abcd"},
{"typeA":"X题型","title":"下面有关十二指肠溃疡病的描述正确的是()","choose":"疼痛部位在上腹正中或稍偏右;有夜间痛醒史;进餐后疼痛可缓解;疼痛规律是疼痛一进食一缓解","answer":"abcd"},
{"typeA":"X题型","title":"胃溃疡疼痛特点可有（  ） ","choose":"餐后1小时;中上腹偏左;中上腹偏右;两餐之间;午夜 ","answer":"abd"},
{"typeA":"X题型","title":"减轻腹胀的方法有哪些()","choose":"运用灌肠或软便剂导泻;用薄荷油腹部热敷;肛管排气;胃肠减压;腹部按摩","answer":"abcde"},
{"typeA":"X题型","title":"理想的抗酸药应具备哪些特点？()","choose":"作用迅速持久;不产气;不引起腹泻或便秘;对粘膜及溃疡面有保护收敛作用","answer":"abcd"},
{"typeA":"X题型","title":"急性胰腺炎常见诱因是() ","choose":"胆道疾病;大量饮酒;饱餐;高热;情绪波动","answer":"abce"},
{"typeA":"X题型","title":"肝硬化失代偿期强调卧床休息的目的是(    ) ","choose":"减少肝脏代谢负担;增加肝脏血流量;有利肝细胞恢复;降低门静脉压力","answer":"abcd"},
{"typeA":"X题型","title":"纤维胃镜术的麻醉方法是(    ) ","choose":"1％普鲁卡因局麻;含服利多卡因胶浆剂;4％利多卡因喷雾麻醉;硬膜外麻醉;腰麻","answer":"bc"},
{"typeA":"X题型","title":"肠镜下息肉摘除术后要密切观察患者()","choose":"腹痛;腹胀;排便情况","answer":"abc"},
{"typeA":"X题型","title":"肠镜检查的禁忌症()","choose":"肛门、直肠有严重的化脓性炎症;各种急性肠炎;妊娠期;腹膜炎、肠穿孔、腹腔内广泛粘连以及各种原因导致的肠腔狭窄者","answer":"abcd"},
{"typeA":"X题型","title":"呕血便血患者饮食护理正确的是()","choose":"肝硬化所致呕血患者限制食物中蛋白质和钠盐的摄入;食道胃底静脉曲张破裂出血患者避免服用粗糙、坚硬食物;少量出血且无呕吐时可选用温凉、清淡流质饮食;肝硬化失代偿期应给高蛋白、高维生素、高碳水化合物食物;消化性溃疡仅黑便无呕血者可给流质饮食","answer":"abcde"},
{"typeA":"X题型","title":"治疗肝性脑病减少肠道氨的产生和吸收的措施()","choose":"限制蛋白;新霉素口服;50％硫酸镁导泻;肥皂水灌肠;乳果糖口服","answer":"abce"},
{"typeA":"X题型","title":"易转变为大肠癌的息肉有()","choose":"腺瘤性息肉;炎症性息肉;家族性腺瘤性息肉;增生性息肉;幼年性息肉","answer":"ac"},
{"typeA":"X题型","title":"以下哪些不是直肠癌的早期症状是()","choose":"便血;排便困难，便条变细;大便习惯改变;里急后重;腹胀腹痛","answer":"abde"},
{"typeA":"X题型","title":"腌制食物中含有哪些物质与胃癌的发生无密切关系()","choose":"脂肪含量高;氯化钠含量高;亚硝酸盐;含防腐剂;.含添加剂","answer":"abde"},
{"typeA":"X题型","title":"若行手术治疗,术前不予洗胃的原因错误的是()","choose":"避免引起胃出血;避免引起胃急性扩张;避免引起胃穿孔;避免洗胃造成癌细胞的脱落种植;.避免患者出现虚脱","answer":"abce"},
{"typeA":"X题型","title":"急性胰腺炎可引起下列哪些并发症()","choose":"腹膜炎;急性肾衰;呼吸窘迫综合征;败血症;DIC","answer":"abcde"},
{"typeA":"X题型","title":"上消化道出血未止的指标是()","choose":"反复呕血;呕血转为鲜红;经快速补液输血中心静脉压仍有波动;血尿素氮降低;网织红细胞计数下降","answer":"abc"},
{"typeA":"X题型","title":"及时评估上消化道出血量的可靠指标是（  ） ","choose":"血红蛋白含量有无下降;病人自我感;呕血与黑便的性状;心率有无增减;血压有无下降","answer":"cde"},
{"typeA":"X题型","title":"胃溃疡疼痛特点可有（  ） ","choose":"餐后1小时;中上腹偏左;中上腹偏右;两餐之间;午夜 ","answer":"abd"},
{"typeA":"X题型","title":"十二指肠为小肠的起始段,包绕胰头,可分为()","choose":"球部;降部;水平部;升部","answer":"abcd"},
{"typeA":"X题型","title":"下消化道包括()","choose":"盲肠;阑尾;结肠;直肠","answer":"abcd"},
{"typeA":"X题型","title":"腹部触诊顺序为()","choose":"从左到右;从下至上;从健侧到患侧;从右到左","answer":"abc"},

]

export default {
  name: 'HelloWorld',
  data () {
    return {
      msg: 'Welcome to Your Vue.js App',
      a:[],
      x:[],
      active:0,
      anwserA:null,
      anwserA1:null,
      anwserX:[],
      anwserX1:[],
      showA:false,
      showX:false,
      show:'A'
    }
  },
  created(){
  	console.log(dataList)
		var _this =this
  	dataList.map(function(obj){
  		if(obj.answer&&obj.answer.length>1){
  			obj.choose=obj.choose.split(';')

  			obj.answer=obj.answer.split("")
  			_this.x.push(obj)
  		}else {
  			console.log(obj.choose)
  			obj.choose=obj.choose.split(';')
  			_this.a.push(obj)
  		}
  	})
  	console.log(_this.x)
  	console.log(_this.a)
  },
  methods:{
  	chooseType(data){
  		console.log(data)
  		this.show=data
  			this.showA=false
      	this.showX=false
      	this.active=0
      this.anwserA=null
      this.anwserA1=null
      this.anwserX1=[]
      this.anwserX=[]
  	},
  	chooseA:function(answer,indexs){
  		this.anwserA1=indexs
		var _this =this
		
  		console.log(answer,indexs)
  		switch (indexs){
  			case 0:
  			_this.anwserA='a'
  			break;
  			case 1:
  			_this.anwserA='b'
  			break;
  			case 2:
  			_this.anwserA='c'
  			break;
  			case 3:
  			_this.anwserA='d'
  			break;
  			case 4:
  			_this.anwserA='e'
  			break;
  		}
  		console.log(_this.anwserA1)
  	},
  	sureA(data){
			console.log(data)
			if(this.showA){
				this.active+=1
				this.showA=false
				this.anwserA=null
				this.anwserA1=null
				return
			}
			if(!this.showA&&data.answer==this.anwserA){
				this.active+=1
				this.anwserA=null
				this.anwserA1=null
			}else{
				this.showA=true
			}
  	},
  	chooseX(answer,indexs){
  		var _this=this
  		var answer
  		switch (indexs){
  			case 0:
  			answer='a'
  			break;
  			case 1:
  			answer='b'
  			break;
  			case 2:
  			answer='c'
  			break;
  			case 3:
  			answer='d'
  			break;
  			case 4:
  			answer='e'
  			break;
  		}
			if(_this.anwserX.length){
				var btn=false
				for(var i=0;i<_this.anwserX.length;i++){
	  			if(_this.anwserX[i]==answer){
						_this.anwserX.splice(i,1)
						_this.anwserX1.splice(i,1)
  					console.log(this.anwserX)
						return  false
	  			}else{
	  				btn =true
	  			}
  			}
				if(btn){
					  				_this.anwserX.push(answer)
					  				_this.anwserX1.push(indexs)
				  					console.log(this.anwserX)
										return  false
	  			}
			}else{
  				_this.anwserX.push(answer)
  					console.log(this.anwserX)
  					_this.anwserX1.push(indexs)
				
			}
  	},
  	surex(item){
  		if(this.showX){
				this.active+=1
				this.showX=false
				this.anwserX=[]
				this.anwserX1=[]
				return
			}
  		console.log(this.anwserX.sort().toString()==item.answer.sort().toString())
  		if(!this.showX&&this.anwserX.sort().toString()==item.answer.sort().toString()){
				this.active+=1
  			this.anwserX=[]

				this.anwserX1=[]
  			this.showX=false
  			return
  		}else{
				
  			this.showX=true
  			return
  		}
  	},
  }
  
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
h1, h2 {
  font-weight: normal;
  padding: 20px 0;
}
h3{
	display: inline-block;
	width: 49%;
	padding: 20px 0;
	background: #eee;
}
h3.active{
	background: #FF5737;
	color: #fff;
}
.showright{
	color: #FF5737;
	padding: 10px;
	text-transform:uppercase;
}
.btn{
	display: inline-block;
	width: 150px;
	height: 40px;
	border-radius: 20px;
	background: #FF5737;
	line-height: 40px;
	color: #fff;
	font-size: 16px;
	margin-top: 20px;
}
ul {
  list-style-type: none;
  padding: 0;
}
.inputa span{
	display: inline-block;
	height: 12px;
	width: 12px;
	border-radius: 50%;
	border: 1px solid #333;
}
.inputa span.active{
	background: #FF5737;
}
.title{
	padding: 10px 0 0 30px;
	font-size: 18px;
	text-align: left;
	font-weight: bold;
}
.inputa{
	text-align: left;
	padding-left: 40px;
	padding-top: 10px;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
input{
	padding-left: 10px;
	display: inline-block;
}
.hello{
	width: 375px;
	margin: 0 auto;
	background: #fff;
	height: 100%;
}
</style>
